{
    "posts": [
        {
            "id": 1,
            "title": "Ambivalence",
            "date": "2013-04-12T11:41:00.000Z",
            "content": "\n\"What am I doing with my life\" is a question I have been asking myself a lot these days. I'm neither working nor studying. I wake up in the morning, read a few articles, do a few excercises on codeacademy and watch a few youtube videos. I go to the gym, I listen to podcasts. Some days I'm all in the mood to be a programmer, cramming as much coding knowledge into my head as I can, other days I'm writing scripts and screenplays which I later make into short 2 minute films and post them to YouTube to be forgotten. There are days when all I want to do is be a journalist, report on the latest in technology and business, work alongside the greats like Casey Newton, Ellis Hamburger and Nick Bilton. \n\nBut that's the problem with me. I sit here trying to be too much. Pushing myself to learn everything and I'm left learning a small amount of everything but not enough of anything. As the saying goes \"Jack of all trades, Master of none\". And what's worse is, I know what I'm doing is wrong but I have no intention to stop. I'm going to keep trying too hard, doing too many things. Mainly it's because I have ADD, I need to keep myself occupied all the time and with different things, untill I figure out how to make that an advantage for me, I guess I'll continue on as I am, an ambivalent human being.\n\n"
        },
        {
            "id": 2,
            "title": "Anchor's Away",
            "date": "2015-08-21T12:44:14.000Z",
            "content": "\n*Originally posted on 14/03/2015*\n\n became a sailor! \n\n\n\nHaha nah, I'm kidding. I did however, get fucking sick of Dropplets, the CMS I was using to host this blog previously. As I had mentioned in the last post, I was fine with it. I got to write in markdown locally and just upload the .md file to my hosting provider. Sure post management wasn't that great, but I did like it. I was annoyed with it a while back when the twitter integration stopped working so it couldn't get my profile picture synced across, so I just ended up customizing the theme and hardcoding my picture from the twitter hosted link thing to the blog. However, a month after, the image started getting issues again. I thought, fuck it. I don't need to use that blog, maybe I'll start using tumblr again. Plus, I was really busy with uni classes anyway. \n\n\n\nEarlier this afternoon, I wanted to blog about how annoying it was that I'm learning C in one class and Java in the other, and both classes are giving us the same problem sets to be done in different languages. Then I was like \"welp nah, my code blog is shit. maybe I should just fix that instead.\" Easy enough, except I needed an outline. also, a CMS. I knew immediately I wanted to use anchor, after [I had written about using it for my about webpage](http://blog.snazzyham.com/index.php/posts/update-jan-2015) but I still looked around for a bit to see if within the time I last did some web work, a new CMS had come out. I decided on Anchor anyway. Then I had to FTP into my current blog and download all the posts to post back on here with the new CMS. Got that done, wiped the dropplets install, installed Anchor and set it up. Then I realised, Anchor doesn't let you upload Markdown posts *(it does have Markdown support, but in the built in text editor only)* so I had to manually do some data entry. Then came problem numero 2, Anchor is still in it's infancy and doesn't allow you to change the date of the post. So all my old blog posts now show as they were posted on today's date; the 19th of March. So to fix that, I just put the date (which thankfully I had cause it was in the .md file thanks to dropplets format thing) at the top of the post. Now that all the backend stuff was done, it was time to think of the design.\n\n\n\n\n\nI was just gonna stick with the default Anchor theme but I wanted a more geeky yet clean look. I really wanted something that looked like [Marco Arment's blog](http://marco.org). So I went on the Anchor Theme's website and did a lot, and I mean a lot, of searching. Finally I found something that looked close enough to what I wanted, [this guy's theme](https://github.com/wadehammes/anchorcms-blue-theme). This template hasn't been updated in a long time, but I didn't care, it gave me an excuse to brush up on my html and css and at the same time procrastinate from my Organisational Behaviour lecture notes. \n\n\n\nI started off with all the spring cleaning, deleting the hardcoded about me section, deleting the sponsored links thing at the bottom, adding the about me section the heading and fixing up the alignment and other stuff. It was more HTML customising than I had done in a while, the last time I did this much coding was when I built my cousin an ecommerce website. \n\n\n\nProbably the hardest thing to do was enable markdown support. Since this theme was from before Anchor supported markdown, my posts were showing up un-formatted. On top of that, the CSS was messed up. The width was only 660px wide so the text was all clumped together and unreadable. After looking for the right font and doing a lot of CSS maintenance and looking through the Anchor forums on how to enable markdown, it worked! It looks amazing now, well as amazing as can be possible in a couple of hours. Which means its still messy as shit, but it's getting there. \n\n\n\nA friend sitting here had the idea that in the homepage when a user clicks on the post it should just drop down instead of opening into a new page, sorta like an FAQ website. Great idea Paluck, you ever considered shifting to UX design? \n\n\n\nAnyway, till next time my internet friends, happy geeking. \n\n"
        },
        {
            "id": 3,
            "title": "Clarity",
            "date": "2015-08-21T11:42:02.000Z",
            "content": "\n*Originally posted on 02/04/14*\n\nI’ve sort of figured it out. If you ever read my blog, or if you just scroll down a little bit, you’ll find that for the longest time I’ve been confused. Let’s start from the beginning. \n\nIn March of 2013, I graduated from high school. I was one of the only few people who didn’t apply to any universities at the the time, I didn’t know what I wanted to do. A part of me wanted to go to film school with the hopes of becoming an editor in the future. The other side of me wanted to go into a computer related degree and become a programmer. Another side of me wanted to just forgo the studying part all together and focus on blogging while taking internships to gain some insight into the entrepreneurial world. \n\nI was confused to say the least. I spent a month in India, busy helping the family prepare for a cousins wedding, this helped keep my mind off things.  While in India, with the help of my sister who was a headhunter at the time, I managed to secure a position as an administrative assistant at a small e-commerce services startup. I spent roughly 5 months there and although I was pretty unhappy for thoseprogrammer,.and I was glad when I left, I had learned a lot. Being the right hand of the CEO was quite the advantage, I gained immense experience and knowledge as to how a startup operates, how to communicate with clients and much more. The company was small and in the Jakarta branch the only two people in the management sector were the CEO and myself, the rest were developers. This may have been quite stressful at the time, with all the work landing on me but looking back I can safely says that in those few months I learned more than I could have ever imagined. \n\nWhen it ended, I was glad. I felt free, for 5 days that is. Then the ambivalence decided to kick back in. I wasn’t doing anything with my lives. My friends were close to finishing their first semester in university and I was unemployed. I dabbled with a little programming on codeacademy and learned quite a bit about HTML and CSS, but as you can see from a few posts back that’s where it ended. I tried a little bit of JavaScript and realized programming wasn’t for me. More on that later. I also dabbled with building WordPress sites, and not to brag or anything but I got pretty good at it, good enough for me to start charging people for my services. \n\nThen came December, all traces of confusion and depression began to fade away. My friends had come back for their holidays and I was distracted from my worries yet again. In the month that followed, I felt like I was back in highschool. \nIt is now February and I have a pretty good idea of where I’m headed and what I’m doing with my life. I currently write for both The Jakarta Globe and Tech In Asia. On the side, I develop websites under the company name [snz designs](http://design.snazzyham.com) where learning HTML and CSS on codeacademy helped me understand web themes enough to customize them to the clients requests, and I dabble with filmmaking and photography when I get the chance. That’s when I realized, I don’t want to be a programmer, but I still want to learn code as it helps me understand web technologies.\n\nI’ll be headed to university (taking up Information Systems and Management) in July, around the same time my juniors from high school will be going. At first that bothered me, but I’m fine with it. Really, I am. If you’ve sat through this post, thank you. It may have come of as me complaining about my life or maybe even bragging about it, but I assure you that’s not what I intended for it. I wanted to write this in the event that someone who was going through what I was came across it and had something to relate to. Heck, maybe I just wrote this to assure myself that I knew what I was doing. \n"
        },
        {
            "id": 4,
            "title": "Code Journal Day 2",
            "date": "2013-12-11T12:38:37.000Z",
            "content": "\n\nI'm day 2 into my \"I wanna be serious about coding\" phase and so far, I haven't been that serious. I've actually been quite lazy and sleepy today. In the morning I went to dad's office to continue teaching him how to use the new inventory management system I had implemented to try and make his life easier. It has potential but right now, well its a long story. \n\nSubsequent to my half day at the office, I returned home to indulge in Edgar Wright's The Worlds End, a film I had been longing to view with my eyeballs since I saw the trailer. It was not bad. *Et puis* I went for a swim, cause it was going to rain and apparently I work differently from most human beings. \n\nOnly after that; which was about 6pm, did I decide to sit my ass down and get on codeacademy. I only completed another 12% or so of the Web Fundamentals course today, completing tables and getting a small look into CSS. Although I didn't really learn much, I learned enough to fix something that has been irking me for the past 3 months. Ever since I switched to dropplets as my CMS for my blog, I've loved the design safe for one feature. I couldn't change the bloody font. As some of you may know I love fonts so obviously this was a pain in the ass for me. Now dropplets doesn't really allow Custom CSS so what I did was add the \" < style ></ style > \" tag to the <span style=\"color:red\">\"Code Injection\"</span> section and input some low level CSS into that and viola. I was able to change the font. I'm seeing the benefits of programming already.\n\n<em>Probably something I should have known from the beginning but didn't is that I can incorporate some html and css elements in my composition of this blog as well, as denoted by the useless blue div you see below. A very doge moment this has been. Also I wonder if I can make use of gifs, something I shall try out in a later post perhaps. </em>\n<br>\n>\n<div style=\"widht: 60px; height:60px; background-color:blue\"></div>\n"
        },
        {
            "id": 5,
            "title": "Coding is fun",
            "date": "2015-08-21T12:44:52.000Z",
            "content": "\n*Originally posted on 22/03/2015*\n\nIt's been about a month of my second semester at uni, and this semester has had a lot more tech related work than ever. I love it. I just got done with probably one of the hardest assignments I've ever had to do, I'm surprised it was only worth 5 marks. Task 1 had us create a program that required us to, you know what I'm not sure I'm allowed to put this online because it's part of an ongoing course. Hmm. \n\n\n\nWell anyway, I've been spending all day at the computer labs this week, literally 10 - 8. It's been wicked fun. Well agonising is more appropriate, but that feeling of figuring out what you did wrong and how to fix it, and then having that suspenseful second where you're waiting to see if your code is going to compile or not. It's insane. Nothing is more ecstatic than the feeling you get of running your code and having it match the required test case outcome. \n\n\n\nMaybe I haven't learned enough for me to call myself a Java or C developer, but I can tell you this. I'm much more of a programmer than I ever have been now, and at this rate, I think I'm going to love this course. \n\n\n\nOn a more ironic note, after spending this much time with actual programming. I'm fairly certain I'd want to focus more on web development after graduating. The web is exciting, and it most certainly seems like the future. Facebook, I'm coming for you. \n\n\n\nI've also been looking into design, and I've heard a lot about sketch. I think I'm going to download the demo and try using it. I will return here with my thoughts. \n"
        },
        {
            "id": 6,
            "title": "Don't know where to start blogging?",
            "date": "2015-08-21T12:47:16.000Z",
            "content": "\n*Originally posted on 05/06/2015*\n\nSo I saw this post on StalkerSpace (La Trobe University's Facebook group, that's basically just a place people share memes) the other day where someone was asking for advice on starting a blog, and for the most part, people seemed to be reccomending WordPress. Now, sure, WordPress is good for the most part, but with all the better options out there, you really can do better. If you're running a full on professional website, sure, use WordPress, it's the best for managing multiple contributor accounts and it's plugin and theming features are second to none, if you're hosting it on your own server that is. WordPress.com is not worth it, mainly because of all the restrictions that come along with it. \n\n\n\n##Medium\n\nIf all you want to focus on is your content, Medium is the place to be. The brainchild of Ev Williams, the man who founded Blogger.com and one of the 4 people who brought us Twitter, Medium is essentially Twitter for long reads. Apart from choosing your images and layout, there isn't much customisation you can do to Medium, but you probably wouldn't want to either. Medium is a benchmark for modern, clean design, and it's WYSIWYG (What you see is what you get) post editor for writing out your blog posts is really an industry leader. Medium lets you focus on your content and only your content. \n\n\n\nProbably the best part about Medium though, is that it's more than just a network of blogs, it's also a platform. This helps take care of one of the hardest parts of starting your own blog, discovery. At the end of the day, when you write something, you want people to read it. On your own blog, your stuck to only sharing within your circle of friends and hoping that your SEO is good enough for people to find it on Google Searches (spoiler alert, your SEO is probably shit). Medium helps take that out of the way. By letting you add your post to collections and tagging them, Medium helps you get your posts to the audience that you want. You also get in-depth statistics on who clicked on your post, how they got there, and whether they actually read it or not. \n\n\n\nHowever, Medium does have it's drawbacks. For one, your audience is not really \"your audience\". This means that if and when you decide to move over to your own hosted blog, unless you made a huge impact on your readers, you're not gonna be bringing most of that viewership to your own blog. Another thing is that although you own the content, you don't really get that feeling of pride and ownership over something, cause your article, no matter how original in content, in design still feels similar to someone else's post on Medium. If this is something you're willing to live with, give Medium a shot. I love it, maybe you will to. \n\n\n\nOther than Medium, if you're looking for an easy to set up, free option that doesn't require you hosting it yourself, there aren't that many good options. Tumblr used to feel like a blogging platform that got turned into a social network for tweens to use GIFs to complain about Pretty Little Liars. However, it seems to have gone through a bit of a shift recently and actually seems like something that may be good to build an audience, like Medium, but more fun and quirky. Seshn and Svbtle are similar to Medium but organise stuff into Magazine's based on topics, and don't have as big a readership as Medium. Wordpress.com and Blogger.com aren't really worth your time, unless you really want to take the time to set it up properly. \n\n\n\n###Self-hosted. \n\nBeing self hosted means that you rent a server, either from GoDaddy or the likes, and you run your own blog on your own domain. This is usually the best option, because you get full control over your blog and can customise it how ever you'd like. It does however, require some technical knowledge, or the willingness to read through the manuals and documentation. \n\n\n\n##Anchor \n\n\n\nAnchor is my favourite new self hosted platform. It's pretty straight forward to set up and has a really easy to use back end dashboard. It's pretty limited in it's own right, and sometimes that's what you want. It's still fairly new, so it's got issues, but for a personal blog, it gets the job done. Plus, if you have knowledge of html and php (or know someone you can hire to do that), you get to customise the blog's design in any way your imagination (or the technology available) will let you. (stinking technology and it's limits). There are also a lot of people interested in Anchor, which means that a lot of people are making themes for Anchor, which is awesome. \n\n\n\n##Ghost\n\nGhost, has probably made the most waves since it's launch almost two years ago. It's the biggest competitor to WordPress and has the most industry backing, from Australian web giant Envato to NASA, yes the space NASA. If this was a high school sitcom, Ghost would be new girl that's kinda shy but really cute that the protagonist is into and makes the really bitchy cheerleader girl really jealous (yes, WordPress is the bitchy cheerleader girl). \n\n\n\nGhost is also the most feature packed, and as an advocate for good design that makes sense, ghost is just fucking beautiful. Wordpress may have stepped up their game with the latest releases, but Ghost is just next level. \n\n\n\nIt's still fairly new though, so it doesn't have as many plugins and extensions as WordPress does, but it's getting there, and soon, very soon. \n\n\n\nThese are by no means the only options, but if you want to start your own blog and have no idea at all on where to start, give these platforms a look, you may find something you love. If you don't, send me all your hate on twitter, I'm @snazzyham. \n\n**UPDATE: The blog you're reading this on is actually running Ghost, isn't it nice?**\n\n---\n\n*this article first appeared on Rabelais*\n\n\n"
        },
        {
            "id": 7,
            "title": "Facebook open sourced this thing that makes debugging easier",
            "date": "2015-08-21T12:49:43.000Z",
            "content": "\n*Originally posted on 11/06/2015*\n\n\"<blockquote class=\"\"twitter-tweet\"\" lang=\"\"en\"\"><p lang=\"\"en\"\" dir=\"\"ltr\"\">Infer | A static analyzer for mobile apps&#10;&#10;This would have been so useful last semester, for my Java assignment. <a href=\"\"http://t.co/2RuReMCTuF\"\">http://t.co/2RuReMCTuF</a></p>&mdash; Soham Adwani (@SnazzyHam) <a href=\"\"https://twitter.com/SnazzyHam/status/609218870050598912\"\">June 12, 2015</a></blockquote> <script async src=\"\"//platform.twitter.com/widgets.js\"\" charset=\"\"utf-8\"\"></script>\n\nIf you visit the [Infer](http://fbinfer.com) website, you'll see this gif of it running. Honestly, this looks pretty cool. It's basically a debugger that gives you possible memory leak and issue errors and stuff, and to be honest, this seems like it would be pretty cool. As far as I can tell, it gives you the issues with your code that a compiler usually wouldn't. I like it. I can't wait to try it out to see how it works. Yay!\n\nThanks for always open sourcing stuff Facebook <3 \"\n"
        },
        {
            "id": 8,
            "title": "First Post Here and Life Update",
            "date": "2015-08-21T12:40:18.000Z",
            "content": "\n*originally posted on 13/09/2013*\n\nHey there internet folk. So by now you're probably confused. This domain used to just redirect to a flavors.me site where you could find out about me and it had a pretty slick design. No doubt I still love the design I made for that (pretty much hate it too) because I mean that's the problem with a lot of things that I do. You can still get access to that if you want at flavors.me/snazzyham. Also, technocastle has a nice look but I've been wanting to get it onto it's own domain, customise the entire site and build it as a standalone site with the wordpress plugin rather than having it as jsut another wordpress.com site. One problem with that is that it takes up a lot of time to build and I don't want to waste time building it if people aren't even going to be bothered to come to the site. Especially since I'm not even sure if I'll be monetizing it. \n\nSo now you're wondering what this blog is for. Well this is going to be my main blog for now, I'll write all my posts here, including the technology ones and everything else that I feel like writing about and later on if I do end up customising the look and feel of technocastle and set it up as a proper site then I'll migrate over all the tech posts from this blog to technocastle but will still post here for the other stuff. \n\nI love how this site is so simple and plain but I plan on going into the code sometime in the future and customising the look and feel a bit, it has default twitter links but I want to try and find a way to make it a bit more custom. \n\nSo yeah I guess that's it, welcome to my brain, you now have access to all my thoughts, opinions, feelings and emotions. Enjoy! \n"
        },
        {
            "id": 9,
            "title": "Great tool for backend blog stuff",
            "date": "2015-08-21T12:53:07.000Z",
            "content": "\nIt's no hidden fact that I'm a huge Vox Media fanboy. Mostly it begins with my die hard love for The Verge, even over the past few months where they haven't felt as much as Verge as before (ever since Creighton, David, Billy, Adrienne, Evan, Dann, Ellis and the others left) but it's still one of the best (if not the best) tech websites out there. Not to mention that their video team produces content that is lightyears ahead of the others, and you can really tell when watching videos from YouTuber's nowdays that they pull inspiration from Verge Video (even if they don't admit it). My probably worrysome love for The Verge aside, another great arm of Vox Media's is their product team. \n\nAs someone who is a technology journalist (\\*cough\\*, blogger), but also a tech enthusiast, I find my self amazed and intrigued by the tech that goes into the backend and creation of the content that most people on see from the front. For example, [Fanboys, the article that changes it's layout and design based on the device you use](http://www.theverge.com/2014/1/21/5307992/inside-the-mind-of-a-fanboy), was mind blowing to not just read, but experience as well. What I loved even more though, was that the Vox Product blog [gave us a behind the scenes look into the inception and creation of the format](http://product.voxmedia.com/2014/2/21/5433452/verge-fanboys-web-design-as-troll) which to me, was way more fun than the product itself. It's since that day that I've been following the Vox Product blog, and that is also one of the reasons I want to work with the tech that goes into journalism. Yeah, I'm a really geeky guy. What I wouldn't give to play around with Chorus.\n\nNow, back to the entire reason I was writing this article. Vox Product today announced [Autotune](http://product.voxmedia.com/2015/7/8/8907841/introducing-autotune), which is like a management system for creating charts, quizzes, graphs and stuff. As far as I can tell, it's what they've been implementing on TheVerge.com lately (especially that cool duo image slider thing they use for reviews) and was a product of the Verge Hack Week (I think?). Essentially now that it's open source, anyone can fork it or install it on their own CMS, and use it for their own websites. WHICH IS COOL. Yay for tools and tech. \n\n*For more tools that I like, check out my [starred repositories on GitHub](http://github.com/Snazzyham)*.\n"
        },
        {
            "id": 10,
            "title": "How do you keep track of news",
            "date": "2015-08-21T12:41:06.000Z",
            "content": "\n*09/16/2013*\n\nNews is probably one of the biggest parts of your day, even if you don't realise it. Reading this post is technically a form of news in one way, although if it's relevant news that's for you to decide. It sometimes get's hard to keep track of the sources and sites that we get our news from and how we manage and sort all of it plays a huge part in how we keep ourselves updated with the world. \n\nMost people prefer using rss readers, as it allows them to organise their sources into folder and mark what they have or have not read. Some people do it the old fashioned way and read newspapers.. good on them! I personally have digg reader installed, but use twitter more often to keep up to date. I follow important accounts that I want the latest information immediately from and keep the other sources in digg reader, the sources I don't necessarily feel share articles I would like to read immediately. When I'm skimming through and find something that I'm interested in but don't particularly have the time to read it I just save it to pocket. \n\nAs much as I'd like to say that I'm really organised with my news and have one centralised location for all my articles, truth is I'm pretty messy. Sometimes my news comes from facebook and even linkedin, a lot of the time it's from a podcast or youtube videos, but most of the time I just go to [The Verge](http://theverge.com) or [TechnoBuffalo](http://technobuffalo.com) and check out the articles there. \n\nWhat about you guys? Do you have a centralised source for news or do you get your information from all over the place? \n"
        },
        {
            "id": 11,
            "title": "I'm back on Dropplets and I'm sad.",
            "date": "2015-08-21T12:50:32.000Z",
            "content": "\n*Originally posted on 30/06/2015*\n\nSo, the blog went down for about a week. The reason for this, the shared hosting provider I'm on decided to move my files to a different server. This did something weird to the PHP settings and anchor (the CMS I deeply fell in love with) decided to stop working. I  spent a whole week trying to figure out why, to no avail. I've tried around 15 PHP based CMS' since, none of them worked. My beautiful theme, my beloved Anchor back-end, all gone. \n\nTo top that all off, since all my posts were written on Anchor, I didn't have the markdown files saved. Yes, that was my stupidity. So what I spent this morning doing was exporting my SQL database from PHPMyAdmin to CSV, opening it in Excel and copy-pasting the articles into Markdown files, re-setting up Dropplets on the server and uploading all the files, and editing the dropplets theme to remove the weird broken twitter picture import thing that it tries to do. \n\nThere are many things I'm sad about when it comes to leaving Anchor, but most of all I'll miss the theme I had on it, I can try to remake it for Dropplets, but I'll have to figure out how to get WAMP to run without my computer freaking the fuck out. It'll be a fun challenge and I look forward to it. I'm also planning on Materializing the standard dropplets install. More on that later. One thing I'll miss the most is the WYSIWYG editor. When I first came on to Dropplets, it was so freeing being able to use my own editor. However, coming back to this now, it's a drag. Having to manually upload files to the server, it's less than ideal. Plus, I have to memorise the whole process of how to get the metadata right for Dropplets, ugh.\n\nAlso the dropplets theme doesn't seem to recognize the intro stuff so my about me from the top is missing (the small section where I link to my Medium and Twitter) so it'll take me a bit to figure that out. I tried hardcoding it but it broke the theme. Oops. \n\nI'll see you soon, interwebs. \n"
        },
        {
            "id": 12,
            "title": "Is Tumblr Good Again?",
            "date": "2015-08-21T12:45:32.000Z",
            "content": "\nOkay maybe not again, but is it good now? I just began writing an article about the best blogging platforms for someone who is looking to start out, and I briefly mentioned tumblr but brushed over it. Today however, I was listening to The Vergecast, and they mentioned something along the lines of how a lot of the people they hired were really popular on Tumblr. I then thought, \"people who aren't teens use tumblr?\". Then I just forgot about it, until 3am when my brain should have been sleeping but was like \"well nah, lets look at what Tumblr does\". \n\n\n\nI must say, I'm quite impressed. The design is overhauled and so much more usable. It's nice to see that it wasn't just redesigned for the sake of a redesign, it was redesign to make things more intuitive and familiar, all while making tumblr seem less childish and more serious. There was something else about it, it felt a lot like Medium. I know I may come across as a Medium fanboy, but that's with good reason. I've often said that Medium is what I consider to be a benchmark in good design standards, and it's nice to see tumblr borrowing from that. The new design also gives tumblr more of a serious appearance while still maintaining everything that was quirky and weird about Tumblr, to a bearable extent.\n\n\n\nI have a process for the articles I write. The ones I write for Tech in Asia stay on Tech in Asia, the ones I write for Rabelais and The Jakarta Globe get reposted on Medium (It used to be on TechnoCastle before I retired that domain) because Medium lets me target a different and broader audience. However, looking at Tumblr now, it seems like something that could help me grow my audience, so here's what I'm going to do. Instead of just posting links to my Medium articles, I'm going to repost them on both Medium and Tumblr now, to get as wide an audience range as I can. I know this may seem unnecessary, but I've noticed a lot of publishers are doing that with their video content now days so it seems like something that may work, it's worth a shot. It does involve me having to learn how to navigate tumblr, but I'm sure I'll figure it out. \n\n\n\nUPDATE: I spoke to a friend, and apparently she uses Tumblr to pick up dudes. I thought thats what kids used Tinder for? I can't keep up with this shit. \n"
        },
        {
            "id": 13,
            "title": "It's time to learn how to code",
            "date": "2013-11-11T11:38:20.000Z",
            "content": "\nYes, I know I have always said that I wanted to learn how to code and slowly I have been learning. i tried learning Java at school but sadly, I think I must've forgotten how to write even a simple GIGO program by now. For those of you lesser tech informed humans, GIGO stands for \"Garbage In Garbage Out\". An acronymisation (or acronymization for you American folk) of a program that does nothing but output certain data to the user, not requiring any input or calculation. \n\nSo after my failed attempt at Java, I tried learning html, be it from some various sources online, to some books I read. I knew enough html to get me through basic stuff but it was never really to the level that I wanted it to be. \n\nYou must be wondering, why do I want to learn to code so bad if it didn't work out the last time? Why do I keep trying again and again? Well the simple truth to it all, coding is essential to what I want to do. I want to work in the tech industry, I want to be able to understand everything related to technology and it's systems and for that I require an understanding of a few programming languages. I want to be able to solve problems, to be able to create working programs by just typing up a variation of code. I want to be like Mark Zuckerberg's fictional representation in \"The Social Network\" as portrayed by Jesse Esienberg. \n\nSo now the steps I've taken; As I mentioned I never really studied HTML seriously, but I'm going to now. I'm starting with HTML and CSS and am 25% through codeacademy's Web Fundamentals class. I find that I've learned more with a couple of days on codeacademy as compared to hours spent watching Lynda.com tutorials. After I'm done with the web fundamentals I'm probably going to try mixing it up and giving PHP a go before I move on to JavaScript. Following that I will try to learn Ruby/Rails if I get the chance and motivation to and I won't stop till I have dominated at least 8 essential languages, and no COBOL doesn't count. \n\nI shall be chronicling my journey here on this blog so stay tuned my fellow enthusiasts and heck, maybe help me on the motivation side of things. \n"
        },
        {
            "id": 14,
            "title": "Java Update - I'm getting better",
            "date": "2015-04-22T12:46:31.000Z",
            "content": "\nWell, exams are around the corner, and the stress level is real. On the other hand, in this past month, I've really become more confident in my coding skills. I guess I realised I was getting better when I watched a video on the google developers channel, and went \"ahh yeah okay.. wait a minute, I UNDERSTAND THIS SHIT!\". \n\n\n\nAnd you know how I said I found it really hard? I still do, but weirdly, I find it fun as well. Like on the last assignment, I probably spent 70 hours doing it, and I didn't even mind. It may have made me emotional every time I got a *NullPointerException* (which I got a lot of), but that feeling of getting it done was actually one of the most fulfilling feelings ever. I ended up getting a 93 / 100 on Assignment 2, and 78 on Assignment 3, which Assignment 3 I could have gotten better but I started it a bit late given I had other stuff, but I was seriously proud given in the first assignment I only got a 50 / 100. \n\n\n\nOn top of that, I'm actually getting used to Java. So much more that I'm gonna say I prefer Java to C. I can't tell you how many times I've tried to initialise a string thing in C and run into weird ass errors. C is fine, Java is just better IMO. \n\n\n\nMaybe I got better when I stopped using Vi? Seriously why do people use Vi. Some people say it makes you a faster coder, not me. It made me waste so much time. I got so much faster when I switched to Sublime. Well I gave Microsoft's Visual Studio Code a shot at first and it was nice, but Sublime's code completion for Java is just so much better. \n\n\n\nOn to another assignment, ITF. I had to build a web store thingy, which I thought would be easy enough given I've made e-commerce websites before, and much more complex ones that what was required. Oh wait, I'm not allowed to use a CMS? Everything has to be done from scratch? That's what fucked me. I got used to SQL quicker than I assumed, but friggin PHP tho. It was all fine at first, once I got used PDO it was getting okay, and then I had an issue where my cart would only show one of the items. 4 hours later. Same problem. You wanna know what was wrong? ONE SPACE. ONE FRIGGIN SPACE. It was (variable, comma, space, variable) and it had to be (variable, comma, variable). ONE SPACE TOOK 4 HOURS AWAY FROM MY LIFE. It was cool though, cause know I finally know why everyone bitches about PHP. \n"
        },
        {
            "id": 15,
            "title": "One Day at a Time",
            "date": "2015-08-21T11:38:52.000Z",
            "content": "\n>*Building a body of work (or a life) is all about the slow accumulation of a day’s worth of effort over time. Writing a page each day doesn’t seem like much, but do it for 365 days and you have enough to fill a novel.*\n\nThis quote by Austin Kleon, has really helped me wake up. His [article](http://austinkleon.com/2013/12/29/something-small-every-day/) (yes its linked) basically says that you should take whatever you do a day at a time. Yes, this is a relatively old and worn out quote but he puts in fresh prospective. I'm not one to make new year resolutions, cause I feel that giving it that tag makes it something you're never going to do anyway. \n\nIn perspective, what I learned from this is that I need to set targets for days, not months or even weeks, *days*. Let me give you an example, when I set out to learn how to code I had said that I would learn HTML and CSS the first month and JavaScript the next. Instead what I should have been doing was setting myself to learn part of HTML one day and taken the next day when it came. \n\nDid that last sentence confuse you as much as it did me? Okay good. Cause I've got too many thoughts running through my head at the moment. See you in a few. \n"
        },
        {
            "id": 16,
            "title": "Paradox",
            "date": "2015-08-21T11:39:32.000Z",
            "content": "\nIt’s funny how things have their way of turning around isn’t it? One moment you’re all all depressed cause thing’s aren’t working out right, then the next thing you know it’s different, and you spend you’re whole day living differently. Kind of like a paradoxical shift. Not necessarily a significant occurrence, maybe it’s something you’ve been waiting for for a long time and it’s finally happening, even though not extravagantly as you had hoped, or maybe it’s something you never knew you wanted but are welcomed by it’s arrival. Either way this event has helped lighten you’re mood. Maybe it’s something you were afraid of or dreading, but never realised it’s true potential until you gave it a shot. It could be something that was right in front of you the whole time, but you were too busy either shutting you’re eyes and/or looking in the opposite direction. I have spent the last couple of years noticing such shifts in attitudes and behaviors, even within myself. It is with that I have come to a conclusion that paradox shifts do exist and they happen when you least expect it. Sometimes they bring about an immense number of changes and sometimes just a small change that still has a way of affecting you, but either way, it still happens. \n\nI know I haven’t clearly separated my ideas in this post, but hey, I’m pretty sure 1% of you understood it. \nP.S. If you’re wondering what my paradox shift moment was, I think the most significant paradox in my recent years was the fieldtrip to bandung, people who know me well will understand that. \n\nsigning out for now, and an indefinite period of time, \nSnazzyHam. \n"
        },
        {
            "id": 17,
            "title": "Phone Issues",
            "date": "2013-09-20T11:40:12.000Z",
            "content": "\nSo in about 2 weeks it's going to be my Galaxy Nexus' 1 year anniversary. Yes I am aware that the GNex released 2 years ago and I bought the phone 2 weeks before the launch of the Nexus 4 (I was impatient, needed a new phone). For the past couple of months I've been having major issues, the phone was fine, installed a custom rom and after a while it got too buggy and laggy. So I went back to stock, it was fine for about a week or two and started getting major lag issues once more. I've repeated this process a lot of times and I get the same results. \n\nPeople (well my parents mostly) say I tinker with my phone to much. Well that's the reason I bought an Android phone, to play with it! I've heard of people doing majorly insane shit to their phones and it always works fine for them, no matter what ROM I run, what kernel I use, my phone always seems to lag. \n\nSo now it's time for a new phone, I thought I had decided what I wanted but I still am not too sure. I'm pretty much set on the Sony Xperia Z1. Why? The three things that matter in a phone to me personally have been fulfilled. Excellent Build Quality? Check. Good camera? 20.7 megapixels of Check. Performance? in the name of the Snapdragon 800 I pronounce you Checked. A major plus is that it's water proof, So I don't have to spend cash on that GoPro I've been hankering for. The only issue I feel I might have with this phone is Sony's software. Which actually doesn't really seem that bad anymore, once you throw in a nice launcher and 3rd party apps, you can replicate the stock experience. I could also root it and run a custom ROM but something tells me that ROM's are not going to be able to take full advantage of that camera. \n\nThe other option I had was to go with the Xiaomi Mi3. You probably don't know what that is. Well Xiaomi is a chinese phone manufacturer much like Oppo, and they sell high end phones at lower prices than the likes of the bigger name brands. The Mi3 has all the latest specs; 1080p, 13MP, great build quality and even gives you the choice between a Snapdragon 800 and Tegra 4 chip. Which is nice. And with the Mi3 I wouldn't mind running a custom ROM if it's gonna be as supported as the Oppo Find 5 (you can run custom rom's without having to root the phone). But in order to avoid making the purchase and there not being support for the device, I'm currently installing MIUI v5 (the Xiaomi OS) on my GNex to see if it's bareable. I've tried it before but didn't like it. \n\nNow you're going to say \"Goddamit man you're messing up your phone\" well hey, it's already messed up and I needed to refresh it anyway. \n\nUPDATE: Been running MIUI for a while, review is up on [YouTube](http://youtube.com/technocastle69) and I'm really liking the performance of it. \n"
        },
        {
            "id": 18,
            "title": "Phonebloks",
            "date": "2015-08-21T11:34:41.000Z",
            "content": "\nHey there internet folk! So some of you may have heard about phonebloks, if you haven't you can check out the video [here](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=2&cad=rja&ved=0CDQQtwIwAQ&url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DoDAw7vW7H0c&ei=O0k0Up7PH8SGrgf8yoHwCQ&usg=AFQjCNFLqSFT_17NMUSK-78ns4BDN2CcZA&sig2=GavDQrCeOeehtmSLDjFA4A&bvm=bv.52164340,d.bmk). What phonebloks basically is, is a concept of Lego for phones. So you get to customise your phone's parts and focus on the things you want. Instead of just throwing away your phone you can throw away the part you don't want. This sort of technique has actually existed for quite a while in the tech industry, where we mix and match our PC's components, and it's just taking that concept and making it mobile, as we seem to do with everything [else](http://www.theverge.com/2013/9/12/4722470/iphone-5s-64-bit-processor-is-a-bigger-deal-than-you-think) these days, but it's actually making it easier. However that's probably all that it'll be, a concept. \n\nIf you think about it, as MKBHD explains in this brilliant [video](http://www.youtube.com/watch?v=IovZRv8toDM), the cost of the phone is actually going to be really high as it costs way more to build a small product or component rather than integrating it. Also, manufacturers wouldn't really have any reason to build these components. Why would nokia build a 41 megapixel camera for phonebloks when they wan't people to buy the Lumia 1020? Also, Microsoft now owns Nokia, why would they want to build something for a phone that most probably will not run Windows Phone? The concept just doesn't live up to reality. Don't get me wrong, I love the concept but I had my doubts and when I watched MKBHD's video, that was my confirmation. This actually really saddens me.. I wanted the Ubuntu Edge to succeed and it seemed like it really would but it just didn't work out. \n\nSome manufacturers would actually love to produce for phonebloks, but those would be the manufacturers that haven't entered the phone market as yet but want to and know that if they try to enter the market by themselves they're not going to have a shot at it, unless they are as clueless as Blackberry in which case good on you man. \n\nI guess that's all I have to say about this, stay tuned for more opinions and what not. See ya folks. \n"
        },
        {
            "id": 19,
            "title": "Post 3",
            "date": "2013-11-20T11:36:16.000Z",
            "content": "Yes it has been quite a while since I last posted in my code journal or whatever you want to call it and that is because I have not really done any studying since the last time. \n\nMostly because I've spent the past 2 days adjusting to Ubuntu, yes I made the switch, AGAIN! This is probably the 30th time I've installed a linux distribution on my laptop and lets hope I don't uninstall it this time. To be honest though I'm really loving it, but then again I always do but still manage to ditch it all the time. \n\nUPDATE: At the time of writing it is now 8:27 pm Jakarta time and  have made a little progress on codeacademy. I'm also learning how to use StackOverflow to overcome some issues I might face and I must say so far I am loving it. Also, I've been on Quora a lot to try and see how companies work and what programming language they priorotise, the answer in short is none. So looks like I am on my way to mastering almost every programming language I can. I think I've got HTML and CSS mostly covered so I should be done with the basics in a week. Then it's Code Year. \n"
        },
        {
            "id": 20,
            "title": "The blog is finally back online!",
            "date": "2015-08-21T16:04:17.000Z",
            "content": "\nIf you'd visited my blog in the past couple of days, you might have been redirected to my tumblr, which had a [post explaining why my blog was down](http://snazzyham.tumblr.com). Long story short, the shared server I was on got shut down and I had to find a new place to host my stuff, and once I did that, I had to re-setup my blog. Now that I was on a new server, I thought of maybe going back to Anchor [since the last server I was with broke the install I had of Anchor](http://blog.snazzyham.com/im-back-on-dropplets-and-im-sad-2/) and I had to go back to Dropplets. I was thinking of maybe just sticking with Dropplets, but that wasn't as nice as Anchor (not to mention with Anchor I already had a theme I had spent quite a few hours working on and it was beginning to look just how I wanted). \n\nSo yeah, I decided to go back to Anchor. That didn't seem to work for some reason. The install kept having issues and then it worked but I couldn't access the admin panel for some reason, after all this struggling I've been going through with the blog I decided to just call it quits and go with Dropplets again. Except, that didn't really work. For some unknown reason, the Dropplets CSS wasn't loading. I tried a lot of things, still couldn't get it to work. I was this close to just re-posting all my old blog posts on tumblr and using that as my blog instead, but I really couldn't find any theme that I liked. It was then when I realised something, I'm no longer on that shitty server I was using, which means I can go back to trying out Ghost! \n\nA few minutes later (God bless you Softaculous) and ta-da! I'm on Ghost now. Took me less time than I expected to re-post all my blog posts on to Ghost, but they're all here now and I'm a happy kid. I'm still using the default Ghost theme as I haven't had the time to figure out how themes work on this yet (apparently you need to re-start ghost everytime you upload a new theme, but I'm on a shared server so I don't really know how to do that) plus I haven't found the exact one I want to use yet. I was thinking of maybe just going off the vanilla \"Casper\" theme and throwing on some [Material Design Lite](http://www.getmdl.io) goodness on there, but we'll see how it goes. \n"
        },
        {
            "id": 21,
            "title": "This is pretty cool",
            "date": "2015-07-04T12:51:27.000Z",
            "content": "\n*Originally posted on 07/04/2015*\n\n>We suspected that mobile users would constitute a majority of our traffic. Fortunately, our web stack provides simple abstractions to deliver content optimized for desktop and mobile. Taking advantage of this, we developed an initial concept for desktop and then reused our code for mobile, placing our product in Facebook for iOS, Android, and mobile web in just a few hours.\n\nIf you're interested in how big companies such as facebook set about developing new features and pushing it, how long the time gap between inception and distribution is, and anything else about code pushes, you might want to read [this article about how Facebook pushed their celebrate pride profile picture feature](https://code.facebook.com/posts/778505998932780/72-hours-to-launch-celebrate-pride/). \n\nI find it fascinating, everything from how they set about deciding when to push it to how they realised their mistake so quickly and managed to change it. \n"
        },
        {
            "id": 22,
            "title": "Update Jan 2015",
            "date": "2015-01-28T12:43:20.000Z",
            "content": "\nHello World. Yes, it has been a while since I blogged here. To be honest though, this blog is just here for me to mess with some HTML and CSS and stuff. In fact, the [CMS that it runs on](http://dropplets.com) has been pretty much defunct for a while. That's why, if you have been to this website lately, which let's be honest you haven't, you would have noticed that the profile picture was a broken link. This is because twitter must've changed their API so the CMS couldn't pull the profile image in. Anyway, that's been bugging me for a while and today I decided to do something. I used CPanel's Code Editor to dive into the backend php files of this CMS and removed the function to pull in profile images from twitter and instead replaced it with a hard coded link to my profile picture so that it would be like that for good. _shout out to u/onthefaceofthings for the profile picture_.\n\nAnyway, I stopped posting on this blog a long time ago. The reason being, I just don't do any personal blogging anymore. I write about tech at Tech in Asia and The Jakarta Globe, and if they don't want my articles it goes on Medium. I stopped posting on TechnoCastle a while back, cause it just didn't make sense. I was never getting any foot traffic there, and the only thing I did use it for was as a portfolio of my writing. I already have that now, which is all linked to on my website. \n\nThere is something I always wanted to do with blog.snazzyham though, I wanted it to be a code journal. Sorta like my process of learning how to code and what I was going through while I tried to learn it. Maybe I'll do that now, probably not though. \n\nAbout a week ago, I set up an about me website on about.snazzyham.com using Ghost, a relatively modern and simple CMS. I loved it. The site was modern and sleek. A day later, my hosting provider suspended my account. After endless emails, he finally responded today and told me that the Ghost install used node.js which was running npm too much and taking up too many resources. So alas, I had to delete the beautiful site that I was in love it. \n\nThen the search began for a CMS to replace Ghost with. I contemplated Dropplets, but I've already used it before and wanted something new. I ended up using [Anchor](http://anchorcms.com) and so far I really like it. It's really barebones and simple, and it's very obvious that Anchor would work better as a blogging platform (because that's obviously what it was intended for) and not an about me site. I'm still contemplating moving over from this dropplets install to Anchor for my code blog, but that's a topic for another day. \n\n\n\nTill next time folks, \n\nthanks for reading. \n\n"
        },
        {
            "id": 23,
            "title": "Welcome to Ghost",
            "date": "2015-08-21T11:21:59.000Z",
            "content": "\nYou're live! Nice. We've put together a little post to introduce you to the Ghost editor and get you started. You can manage your content by signing in to the admin area at `<your blog URL>/ghost/`. When you arrive, you can select this post from a list on the left and see a preview of it on the right. Click the little pencil icon at the top of the preview to edit this post and read the next section!\n\n## Getting Started\n\nGhost uses something called Markdown for writing. Essentially, it's a shorthand way to manage your post formatting as you write!\n\nWriting in Markdown is really easy. In the left hand panel of Ghost, you simply write as you normally would. Where appropriate, you can use *shortcuts* to **style** your content. For example, a list:\n\n* Item number one\n* Item number two\n    * A nested item\n* A final item\n\nor with numbers!\n\n1. Remember to buy some milk\n2. Drink the milk\n3. Tweet that I remembered to buy the milk, and drank it\n\n### Links\n\nWant to link to a source? No problem. If you paste in url, like http://ghost.org - it'll automatically be linked up. But if you want to customise your anchor text, you can do that too! Here's a link to [the Ghost website](http://ghost.org). Neat.\n\n### What about Images?\n\nImages work too! Already know the URL of the image you want to include in your article? Simply paste it in like this to make it show up:\n\n![The Ghost Logo](https://ghost.org/images/ghost.png)\n\nNot sure which image you want to use yet? That's ok too. Leave yourself a descriptive placeholder and keep writing. Come back later and drag and drop the image in to upload:\n\n![A bowl of bananas]\n\n\n### Quoting\n\nSometimes a link isn't enough, you want to quote someone on what they've said. It was probably very wisdomous. Is wisdomous a word? Find out in a future release when we introduce spellcheck! For now - it's definitely a word.\n\n> Wisdomous - it's definitely a word.\n\n### Working with Code\n\nGot a streak of geek? We've got you covered there, too. You can write inline `<code>` blocks really easily with back ticks. Want to show off something more comprehensive? 4 spaces of indentation gets you there.\n\n    .awesome-thing {\n        display: block;\n        width: 100%;\n    }\n\n### Ready for a Break? \n\nThrow 3 or more dashes down on any new line and you've got yourself a fancy new divider. Aw yeah.\n\n---\n\n### Advanced Usage\n\nThere's one fantastic secret about Markdown. If you want, you can  write plain old HTML and it'll still work! Very flexible.\n\n<input type=\"text\" placeholder=\"I'm an input field!\" />\n\nThat should be enough to get you started. Have fun - and let us know what you think :)\n"
        },
        {
            "id": 24,
            "title": "What is the Snapchat Benchmark?",
            "date": "2015-07-08T12:52:25.000Z",
            "content": "\n*Originally posted on 08/07/2015*\n\nA couple of people that follow me on twitter have asked me lately, why does it say \"Creator of the Snapchat Benchmark\" on my profile.\n\n>*So what exactly is the Snapchat Benchmark??*\n\nEssentially, the Snapchat Benchmark is an ideology that was first implemented when I reviewed **[Xiaomi's Mi4i](http://medium.com/@SnazzyHam)**, that builds on the foundation of testing a phone's capability to keep up with the things people in my age group would do on a day to day basis rather than just with the regular, processor based benchmarks that most people run (aka *GeekBench* or *Antutu*). \n\nThe benchmark runs through several elements of using snapchat, such as how quick it is, how long snap stories take to load, whether it can handle filters without crashing, is video laggy and many more factors. The main reason for using Snapchat as the benchmark app is \n\n- it's what my friends and I, and most of the people in my age group use on a daily basis.\n- It's the only app that always has problems on Android. \n\nOn my HTC One, video on Periscope/Meerkat would work flawlessly, taking pictures on the regular camera app worked like a charm, but take it into Snapchat and videos would have a weird green hue to it, videos would be choppy and unwatchable and even attempting to swipe to add filters would cause the entire phone to crash. \n\nAnother thing that inspired me to create the Snapchat benchmark was when a friend asked me for a phone recommendation and I asked what his requirements were, he responded with *\"pretty much just **snapchat**\"*. \n\n"
        },
        {
            "id": 25,
            "title": "Why are there so many great note taking apps",
            "date": "2015-05-14T12:48:26.000Z",
            "content": "\n*Originally posted on 14/05/2015*\n\n\"You know what, I type a lot. Well I write but I don't *write*, I *type*. I take a bunch of notes, I write down anything from ideas to articles, and a whole semester worth of lecture notes a couple of days before an exam. Which I should be doing right now. Yay procrastinating. Back to note taking. As readers of this blog may know, I love apps. I like services that look good, perform well and make your life easy. I make sure I have a great app for everything, from my ToDo and Calendar apps to [fucking calculator apps](http://numi.io), ffs what's wrong with me. By far an app that I use the most is notes. \n\nAfter Apple's WWDC thing, I really liked what they were doing with Notes.app, the built in note taking app on Mac and iOS. I never really thought about it as an app I would use, from being an app that was pretty bad and lacking so many functions, to the fact that I don't use an iPhone so I wouldn't be able to sync. Which was the only good thing about the app. I wasn't too worried anyway, because who really cares. There are so many great note taking apps. \n\n##Evernote\nI personally use [Evernote](http://evernote.com). It's hailed as the best app to take notes out there, and it kinda is. It syncs across my phone, iPad, Macbook and PC, and the web interface is perfect for when I'm using the computers in the lab at uni and need to access my notes. You can format text, add bullet points and checklists, reminders, highlighting, image adding, really quick web clippings and if you pay for pro you get pdf annotating, turning your notes into presentations and way more. \n\nBut as much as I love it and rely on it, I feel like there's something missing. First and foremost, Markdown. As someone who thinks while - instead of before - he writes, markdown helps be style on the fly. Having to slow down to bold and italicise my text and instantiate bullet points, it gets on my nerves and slows my typing down when I'm making notes. Also, this is pretty much just me being a \"\"winging slut\"\" as my roommate would say, but it looks a bit too refined. I like that raw, modern, startup-like look. There's just something about evernote. I can't put my finger on it. \n\n##Ulysses\nHands down the best looking app I've ever used. I used it for some of my assignment work last year and it blew me away. Not only did it look friggin dope, it also had the best sharing and exporting features I had ever seen on an app and oh my God the power user features are just top notch. Seriously, [check this out](http://ulyssesapp.com/mac/).\n\nIt's paid though, keep that in mind.\n\n##Mou\nSometimes you want to write something really quick, like a quick simple text editor, but also preview your Markdown while you write. That's where Mou comes into play, it has a side by side editor / preview layout and I love it. I use it mostly for when I'm writing out something quick that I don't really need saved, like a quick blogpost or an email. I used it extensively before we implemented Markdown support on Tech in Asia, because Mou's \"\"Copy as HTML\"\" was honestly the best thing ever and saved so much time. It essentially let me copy my markdown as HTML so I could paste it into WordPress' text view thing and have my post perfectly styled. Yay! \n\n##Simplenote \nThink of Apple's notes app, but better and cross platform. It was quick, clean, well designed and probably the best app for quick and *simple* notes, no pun intended. Too bad I had no use for it, because I started using Evernote for my smaller notes as well, just so I could limit the number of apps I use. \n\n##Draft \nI had mentioned that I use Evernote for everything note related. However, a majority of my writing involves writing articles, be it articles I may want to write for Rabelais, The Jakarta Globe, Medium or elsewhere. A reason I don't use Evernote for my articles is I need something that doesn't format my text, I've started using Draft for that. Let me preface this by saying that there are many apps I would much rather use for this, such as Ulysses. Alas, I need sync. I work on a laptop primarily now, while I'm at uni, but when I'm at home I mostly work on my PC running Windows (soon it'll run Arch though) and I need my articles to sync across. I used to use Google Docs for this, but then I found [draft](http://draftin.com), which is basically Google Docs with Markdown support and previews, and since I started using it it has amassed a feature list so large it's insane. You guys know I love native apps, but there are times when you need a web app, and this was the best one available. \n\n##Writely \nWhen you need a phone app that supports markdown for the quick blogpost you write while on the toilet at the mall and at the time was the only one available on Android. \n*Since that one time I needed it, iA Writer came out with an Android app and mvilla, the developer that made [my favourite twitter app](https://play.google.com/store/apps/details?id=it.mvilla.android.fenix&hl=en) made a notes app as well.*\n\n##FoldingText\nI actually haven't had the chance to try out this app, but I heard them mention it on the Accidental Tech Podcast and my God it looks like a power user's dream. To bad I'm too deep into Evernote, and it doesn't have sync. :( \n\n##Vesper\nJohn Gruber, who is famed for being a major Apple Fanboy and someone a lot of Android fans despise, made this app called Vesper. It's iPhone only, so in almost every occasion I wouldn't give a shit. However, Gruber is the guy that created Markdown. So if he created the standard, the app he used must be pretty good right? \n\nThere are so many more apps, but these are the ones that were off the top of my head. This was supposed to be a quick post for my 5 minute study break, but it's been 45 minutes. I better start studying. Ttyl readers. \"\n\n\n"
        },
        {
            "id": 26,
            "title": "Why do I find it so hard to focus on programming",
            "date": "2015-01-29T12:42:24.000Z",
            "content": "\n*Originally posted on 29/01/2015*\n\nHello world, I'm back again. Two posts in two days? wow. So as some of you may know, I took [codecademy's HTML and CSS](http://codecademy.com) web development course, and surprisingly finished it. Sure it took me over two years of starting it, getting bored, forgetting about it, starting it all over again. But hey, I finished it. \n\nFollowing that I took a break from learning and decided to put my newly learned skills to use, by building websites. I built one for my dad, one for my cousin which never ended up being completed and made endless changes to my own portfolio of websites. \n\nAround 3 months ago, I decided to start learning again. I didn't want to learn the way I did with HTML and CSS though. I wanted it to be extensive. So I took Harvard's CS50 (an introduction to computer science) course, and I loved it. In one lecture David Malan was able to explain to me what Binary was, something my Computer Science teacher failed to explain to me in 2 years of high school. I got 3 weeks into it, that's 6 lectures, and I got bored. Also, I forgot about everything. \n\n3 weeks back, I decided to go back into it. I jumped into week 4 and had no idea where I was. I decided to retake it from the beginning. 2 weeks into that and I got bored again. The language was C. \n\nI thought, you know what? Maybe I'm just not into coding. At the back of my mind, I knew that was a lie. Yesterday, [when I was messing around with my blog's code](http://blog.snazzyham.com/update_jan_2015), was ecstatic. It was the most fun I had in a while. Then it struck me, maybe I'm not into regular development coding. Maybe I'm more into web tech? So for now, I think I'm going to pause CS50, and maybe do Codecademy's PHP lesson first? \n\n\n\nWish me luck. \n\n\n"
        },
        {
            "id": 27,
            "title": "Windows 8.1U1 Wishlist and Rant",
            "date": "2015-08-21T11:37:22.000Z",
            "content": "\n######What will it take for my love for windows to return?\n\nBelow is an excerpt of my rant on Windows.\n\n>Then, in the first week of 2014, I had enough. Windows had crashed on me for the nth time. I bit the bullet, not in the way that you’d expect it. I cloned my windows install from my PC and put it on my laptop, deleting ubuntu, and I hackintoshed my PC. I am now a proud and happy Mac user. I love the OS, it’s overall more stable, it is much more productive and I won’t bore you with all the details, I’ll save that for a later rant. Sometimes however, I consider switching back. \n\nThe above rant can be found at [Medium.com](https://medium.com/p/fdf34b70e224)\n\n\n"
        },
        {
            "id": 28,
            "title": "What's your workflow?",
            "date": "2015-09-02T10:24:52.000Z",
            "content": "\nEveryone has their own workflow for getting stuff done, be it developing websites, writing an article or anything else; like getting an assignment done (which I probably should be doing right now). In development terms, this commonly refers to your process of working on a project.\n\nWhen it comes to developing a website, here's how my workflow goes now. If it's a CMS reliant project, I install that CMS locally first on my computer, set everything up, build the site in Atom and make changes in Chrome DevTools' Inspect Element pane until I find the change that works then copy those to over to Atom before I ftp them over to the server. Yes, I know there's a much more efficient way to do this, even replacing Atom completely with DevTools, but there's quite the learning curve to getting everything set up and I'm still getting to that. \n\nFor plain HTML sites, I pretty much do the same thing except I've gotten so used to just doing the edits directly in Atom and then refreshing to see if worked (since it works faster compared to working on CMS files as the CMS needs to be refreshed). I've been reading up on DevTools over the past few days, and was thinking of porting my entire workflow over to DevTools, until about 5 minutes ago. \n\nI was [reading this article on techcrunch](http://techcrunch.com/2015/09/01/mozilla-relaunches-its-thimble-online-code-editor-for-teaching-html-css-and-javascript/?ncid=rss&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Techcrunch+%28TechCrunch%29&sr_share=facebook) about this tool called [Thimble](https://thimble.mozilla.org/) that Mozilla developed to aid in the \"code education\" sector, so I decided to take it for a spin. Although it seems super simple and barebones, I actually really like Thimble and feel like it would be a great tool to use when updating static HTML sites and what not, thanks to it's live updating feature. I know Bracket's does something similar (in fact, this is built on Brackets I think), but I think this could be a great tool for quick changes and edits and I'm looking forward to giving it a shot. \n\nAnother thing that interests me is that this could be really great for a chromebook user, ironic given it's a mozilla product. \n\n*Wanna talk to me? Shoot me a DM on [Twitter](http://twitter.com/snazzyham).* \n\n<center><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/JecFOjD9I3k\" frameborder=\"0\" allowfullscreen></iframe></center>\n"
        },
        {
            "id": 29,
            "title": "Dotfiles",
            "date": "2015-09-06T12:11:34.000Z",
            "content": "\nI just learned about dotfiles/automation in bash and holy wow they are so super cool. Instead of me trying to explain what they are, you should probably just read [this post by Lars Kappert](https://medium.com/@webprolific/getting-started-with-dotfiles-43c3602fd789). \n\n###How did I use it though?\nWell, so far I've not done much, since I'm still trying to learn it properly. What I have set up so far, is a few alias'. So everytime I type 'code' it takes me to\n             >sohamadwani/Dropbox/Documents/Code\n\nand the same goes for other folders I access regularly in terminal. Another really exciting use case is being able to automate my SSH login into my University's file server, so instead of having to go through the whole rigamarole of typing in my extremely long ssh username, I just have to type in ltu and fills it out for me. Perfection.\n\nI feel like there are so many more use cases, and I can't wait to try them out. \n"
        },
        {
            "id": 30,
            "title": "My Blog Went Down Again.",
            "date": "2015-12-10T14:53:08.000Z",
            "content": "\nso if you’re an avid reader of my blog, you would have read through that whole debacle where the cms of this blog was so messed up that I stopped using dropplets and switched to anchor instead, only to have it crash on me, requiring me to switch to ghost. Ghost worked great, I built out a nice theme for it, I spent probably 50 or more hours working on the design of it alone, and got to exactly where I wanted. I was at that point where I knew I didn’t have to do any work on it for at least a year. I had written around 11 posts in the ghost editor, I can’t really remember what they were about, but the last one was about dotfiles. \n\nFast forward a month, I forgot the login to my ghost account and I got locked out. The only way to get back in, was to click forgot password, and of course, I didn’t have email set up. So I went into the config file to set it up, and for some reason, Gmail wouldn’t work. Posts on the forums suggested mailgun. I decided to mess around with gmail for a bit, but I still couldn’t get it to work. Just to give you a sense of time, up until this point, I had already spent about 3 hours on this (in between rooting my sisters old phone to give it new life). So I signed up for mailgun, and I got blocked instantly. It was one of those spam detector things. I get it, it happens. So, I created a support ticket. Around 20 minutes later I got an email from mailgun saying I had access to the account. It was at this point, I was already fed up with everything, and I noticed that MailGun and Ghost had this generator that would just let me put in my API key and it would auto-generate a config.js file for me. This seemed awesome, given I had already been fucking around with the config.js file so much thanks to the stupid gmail thing, and I wanted a clean slate. You may see a lot of problems with this. I should have as well. As soon as I replaced the config.js file, it was all gone. My whole blog, all my posts, everything. I tried going back into phpMyAdmin to see if I could salvage anything, unfortunately I was too late. It was all gone. I made no backups. \n\nWell, I did have backups, just none of the posts from the ghost install. This means that the 11 posts I had written on the ghost editor, were lost to the world. \nI was a little upset at first, but I’m going to take this as a learning moment, and I’m going to start backing things up. I’ve decided, as nice as it is to have a CMS with all the bells and whistles, maybe I should switch back to flat-file, cause that way I always have a backup of my posts. I host my website with A Small Orange, and as always their support was second to none. Shout out to Nick, their support shogun. They’re trying to restore my database, but I’m unsure if they’d be able to. Fingers crossed. \nAs for now, I’ve got hongkiat.com open and I’m taking a look at all possible options for my next CMS. If all else fails, I’ll probably go back to dropplets, even though it sucked and has received no updates. Hopefully, another option presents itself soon. If you’re reading this on blog.snazzyham.com, hoorah, I figured it out and you’d probably have seen an update post above this one. However, if you’re reading this on tumblr, I’m probably still working through it.\n \nI hope you as readers have learned something from this, and if you’re aspiring to start your own blog, please remeber, back shit up.\n \nSigning off for now, \nSoham.\n"
        },
        {
            "id": 31,
            "title": "Sometimes, things work out.",
            "date": "2015-12-11T03:39:08.000Z",
            "content": "\nA couple of hours after contacting my hosting provider, they got back to me with what they thought was bad news. Their backup script stopped working, and the last backup they had of my website was over a month old. To most people, this really would be a problem. However, this past month for me has been so busy, that I actually didn't upload a single blog post. Yes, that means that they were able to restore my blog and it's back up and running. \n\nNow, remember in the previous post I said I was fine with that theme and that it would stick for about a year? I was wrong. I looked at it again, and it just looked too \"Medium-y\". So yeah, I'm going to change the design to better reflect the simplicity that I want it to reflect. Plain text on a plain background. \n\n###MOAR UPDATES. \nSo now that all this is over, I thought I'd write about what I've been doing lately. So after exams were done, I got back into web development really heavily. I've been building out a business landing page for [Content Collision](http://contentcollision.co), and I've also started an internship at [Percolate Galactic](http://wearepercolate.com), which is hands down one of the coolest desing houses in Jakarta. I've only been there about 2 weeks and I already can't imagine leaving. So with them, I've been working on re-building their whole web-presence. At first we thought we'd use squarepace and replicate the current website (that had just been built about 6 months ago), but after taking a look at the results we decided it would be better to build the website from scratch, so I've been doing that based on the layout and designs that their incredible designers have come up with, and we should have a finished product soon. \n\nWhile I'm not working on the website, I've been trying to build an app. Percolate had this concept of a fortune telling cat-in-a-box, that gives you fortunes you may not want to hear. They had the whole box thing, where at events an intern would just sit inside the box and hand people their fortunes, so I set about turning that into a full-fledged app. I prototyped the app in Java first, before moving that over to JavaScript with a front-end that if you ask me, is horrible. That's not a problem though, it's just a prototype, sorta like a proof-of-life. Now all I have to do is learn either react native or swift, and turn it into an actual app. You can check out the prototype [here](http://spencer.snazzyham.com), but shh, don't tell anyone I told you.\n\np.s. I started vlogging again! [Check out episode 1](http://youtube.com/user/technocastle69) and let me know what you think! \n"
        },
        {
            "id": 32,
            "title": "Functional Vs. Beautiful Design",
            "date": "2015-12-13T07:15:03.000Z",
            "content": "\nI'm a huge fan of design. I'm not talking about paintings and art, I'm talking about product design. Be it something physical such as an external hard-drive or a set of beautiful speakers, or something software based like a website or [Numi](http://numi.io/), my favourite calculator app. However, as I've been immersing myself into the world of design and development, I've learned that you can't really forgive bad functionality in the name of good design. Sure, design is pretty to look at, but sometimes you have to stop and think, what's been sacrificed in order to achieve this design? \n\nAs another example, let's look at Wire, the messenger app. Wire is probably the cleanest and best looking messenger app available today. It's clean and minimal, and doesn't try to do too much. It focuses on clean typography (although they've since switched to using system fonts) and large, beautiful imagery. It's probably my favourite messenger app. However, no one in my family uses it, and I don't expect them to. I got a few of my friends to give it a shot, but they ultimately left it behind as well, and I don't blame them. Wire is great if all you want to do is text and call, but that's literally all it does. There's a reason everyone I know defaults back to WhatsApp or Messenger (other than because everyone is already on it), and that's because those afformentioned apps have much better functionality. Sure, whatsapp doesn't look as good as Wire, no wear near as good, but its image sharing is superior, it has more features and its just more reliable overall. \n\nThere are of course times where design can trump a lack of functionality, but it's not really that common. Medium is one of those examples. Sure, you could start a blog that gives you more control or you could even use tumblr and gain access to more functionality as compared to Medium, but it's Medium's clean aesthetic and focus on design that makes it so critically acclaimed. Medium, in tandem with the excellent design firm Teehan+Lax, managed to do what most people just can't afford to do. \n\nAs my final example, let's take this blog. Yes, the one you're reading this post on. Most of you might find that this blog has a very plain and boring feel to it. This may be true, especially in contrast to the last design. The last design was a fork of the standard ghost theme, with the addition of some beautiful fonts from the Google Font library, along with a heavy focus on high resolution imagery. It looked great, almost Medium-like in a sense, but here's why I had to move away from that. The load time for my blog on mobile was 14 seconds on a 3G connection, that may seem fine, but try and picture yourself staring at a blank screen for 14 seconds waiting for my content to load. Chances are, after 5 or 6 seconds, you're likely to just close the tab. Sure I miss my old theme a lot, but it just didn't make sense to keep it. People come to my blog to read the content I put up, and before, I believed that part of the appeal was the typography. Here's something you need to know about using typography from stacks such as Google Fonts, when someone accesses your webpage, those fonts have to be pulled in from the CDN first (aka the place they are stored). This causes an impact to your load time. What I'm doing now, is using a system font known as Monaco, so the browser doesn't have to go somewhere else to pull a font, because your device already has that font. Of course I'm still using a Google Font for my headings, cause that doesn't really impact load times much, but using a system font for the huge chunk of body text has really improved my load times by quite a bit. So yeah, maybe my blog doesn't look as pretty as it used to, but now, there's a heavier focus on the quality of my content, and for a blog like this, that's really all that matters. \n\n#####So why doesn't my website look as plain as my blog?\nWell, as much as I believe in keeping things as functional as possible, my primary source of income is that I'm a freelance web designer, so my homepage has to be an example of the skills and talents I possess, I guess we could consider that functional in it's own right. \n\nNow yes, there are definitely a lot of people who are willing to overlook a products functionality in favour of how pretty it is (I'm looking at you, Macbook One) and everyone is entitled to their own opinion.  There are also situations where no matter how functional, sometimes you really do need to think about a better design. Which is why no one knows what Apple was thinking when they [released something as ugly as this](http://www.theverge.com/2015/12/8/9867996/apple-smart-battery-case-iphone-6-6s-hands-on). So what do you think, does beautiful design trump functionality? [Tell me what you think!](http://twitter.com/snazzyham)\n"
        },
        {
            "id": 33,
            "title": "Giving Spencer a face (Pt. 1)",
            "date": "2015-12-18T04:33:38.000Z",
            "content": "\n###My first foray into app development\nWell, not really. Well yes, but still, no. I'm not like, going full on into iOS development with swift or obj-c, and I'm not going into full on Java (even though I would like to at some point) for Android development. \n\nFirst, the back story. When I joined Percolate a couple of weeks back, one of the first things I was tasked to do was take Spencer, a fortune telling cat-in-a-box, and turn him into an app. I prototyped it first in simple java, which didn't take too long. All I needed was an array to store the quotes, a random generator that chose a number between 1 and 'quotes.length', put that in a loop and viola, spencer 0.1 was ready. \n\nObviously, the next step was to build spencer a face. I decided I would build spencer from scratch in JS and HTML. I knew I was only using Java to line it out and see what the project would look like syntactically. So I looked on github for a random quote generator, and [this one stood out](https://github.com/typefast/quote). It was simple and easy, and helped me see exactly what I needed to do. So I took that, changed the colours around, and I was left with spencer 0.11. A much lighter, and more profane version of Typefast's quote. I was on the right path. \n\nHowever, that's when something struck me. So the idea of spencer came from a project percolate had already done, and therefore they already had the fortunes and illustrations they wanted to use, which were image files, rendering my random 'quote' generator useless. It's at this point I would usually just modify the current spencer files to try and use images instead of texts in my quotes array. However, I had a feeling that in the long run, that really wouldn't lead to an efficient final product. So instead of going back to github, since I already understood how the quote generator would work, I decided to build the entire thing from scratch. However, I struggled with the decision for a bit. Did I want to build it out from scratch now, and risk having to do it again later when I decide which platform to use, or leave it and risk having to figure new shit out later? \n\nI decided to re-build the whole thing later. Temporarily, I worked on getting the images into the array and displaying it as an actual image ussing js' innerHTML tag. It worked well, but it still felt very prototype. \n\n###Fast forward 2 weeks\nIt's now two weeks into this, in between building the main website, and I've decided to go with Framework7 and  PhoneGap. Framework7 can be considered as bootstrap, but for building web-based mobile apps. PhoneGap on the other hand, takes those HTML and JS based apps and builds it into an actual .app or .apk file, ready to be pushed to the App Store or Play Store. I've just spent a couple of hours getting everything set up, and I'm still having some trouble getting the emulator for the sample app to build. I've also noticed, being constrained to a small laptop screen after being used to my either 22inch monitor or multi-monitor setup has hindered my productivity and speed quite a bit. I never really thought it would affect it that bad, but my oh my am I faster when I have so much more real estate to work with. \n\nSo yeah, TL;DR: We're building the app using Framework7 and PhoneGap, and good news, **Spencer is going to be Open Source!** I haven't quite figured out which license yet, but all that can come later. Be sure to keep checking back here to keep track of progress. \n"
        },
        {
            "id": 34,
            "title": "Blue or Gold?",
            "date": "2015-12-21T15:04:33.000Z",
            "content": "\nYes, I'm talking about the dress. No, it's not what you think it is. I've recently been scouring the webs looking for decent engineering blogs to add to my feedly, and boy does BuzzFeed have an amazing dev blog. I know right? Who would've known. \n\nRead [this article](http://www.buzzfeed.com/daozers/what-its-like-to-work-on-buzzfeeds-tech-team-during-record-t#.ydvYEwrrA) about how they handled the server loads on their busiest ever day in history, the day that damned blue and white (or black and gold) dress appeared on the internet. \n\nSeriously, if you're into tech, such a good read.\n"
        },
        {
            "id": 35,
            "title": "building \"I'm Crushing It\"",
            "date": "2015-12-25T04:17:00.000Z",
            "content": "\nHey reader, yes you, how have you been? Good. Now that we got that out of the way, do you have any resolutions for this year? I know, resolutions are stupid, an opinion not many people agree with. Luckily, everyone I work with over at [Percolate Galactic](http://wearepercolate.com) agrees. That's why we set out to build [imcrushing.it](http://imcrushing.it), the brainchild of our brilliant CEO Ryan. I'm crushing it is a New Year Resolution generator that pokes fun at people who make new year resolutions, by providing you with the most sarcastic, nasty and hilarious resolutions the 10 of us could come up with. So yeah, the next time someone asks you what your resolution for the year is, we've got you covered.\n\nBuilding it was probably the most educational 2-days I've had this week. I started by taking the prototype to Spencer that I forked from a JS project and tweaked [(which I wrote about here)](http://blog.snazzyham.com/giving/), and at first I just tweaked the design, worked on the theme and stuff, once I was happy with it looking as basic as possible, I worked on animating it. Yeah, this wasn't something I had thought of when working on spencer since we were working with images instead of text, and we had a separate background for the part with the image, thus not requiring any animation (since we used the built in iOS page change transition). Another thing that inspired me to add animations to the text was [@gk3](http://twitter.com/gk3)'s brilliant DJ Khaled quote generator, [theydontwantyouto.win](http://theydontwantyouto.win). That website should really be the benchmark for quote/text generators.\n\nAfter some research, I decided textillate.js was the best option. The setup process was fairly complicated (well I over-complicated things myself, it was actually pretty easy at the end) and once I figured that out, I got it to work! However, it only worked with the text elements that were on the page, and not with the div that I had pulling the quotes from my array in JS. I must've spent about 4 hours working on that, putting the class in different locations, nothing worked. I thought, why create a GitHub issue? The developer behind it got back to me the morning after, and let me know that textillate doesn't play nice with js files, but told me that he would keep it in mind for v 2.0. Yay, I made a contribution, I think? Anyway, time to find a second option.\n\nI looked into blast.js for a bit before I ended up with the conclusion that there was not enough documentation around it, and since we wanted this built pretty quickly, there really wasn't any time for me to experiment. I ended up settling on animate.css, and settled with having the entire string of text animating instead of the words individually. A little css and JQuery magic later, and viola, it worked!\n\nPretty much the entire foundation was set, all I had to do was figure out the sharing buttons and it was on to design. The facebook and LinkedIn share buttons were fairly simple, given they don't allow you to take text from the innerHTML and place it into the share dialog, but I've seen twitter share's that let you, so I scoured StackOverflow until I finally had something that worked.\n\n###Design\nNow, the design. Ryan mentioned that he wanted something that looked like a generic startup landing page, and I found the perfect template on StartBootstrap. I cut off the navbar and everything but the main image /container, set the overflow to hidden and it was perfect. All I had left to do was migrate the JS files and format the HTML to match, and winner winner chicken dinner, ImCrushing.it was ready.\n\nWhile working on editing the resolutions however, we figured the \"generic startup starter kit\" background image wasn't ironic enough. Like it conveyed a message, but not the one we wanted. That's when we decided to go with the current image, because it pokes fun at people who overly identify as millenials and hipsters, the kind of people who spend all their time at a coworking place cause it's the \"hip place to be\".\n\nAs much as we loved the picture, the fight to stay modern left us in defeat. What I mean by this essentially is that the image file was too small, which left it looking fine on smaller mobile devices like the iPhone 5, open the app on a larger device however like an iPhone 6plus or a laptop and it just looked like hot garbage.\nFinally we went with the image that is on the website now, an image akin to the ones you’d find on an inspirational tumblr quote.\n\nWe did not intend to offend anyone with this program, but we probably did.\n\n---\n_ImCrushing.it is Open-Source, and can be found [here](http://github.com/snazzyham)._\n"
        },
        {
            "id": 36,
            "title": "Sharing files over a network",
            "date": "2015-12-28T05:48:19.000Z",
            "content": "\n\nI'm a huge fan of tools that make file sharing easier. Over the years I've tried pretty much every tool for file and media sharing over a network, everything from Younity and BitTorrent sync to setting up a samba server. However, the bugs that presented themselves with all those left me to just end up using dropbox for everything instead. \n\nWhat sucks is when I have to send files to someone else in my house, like my sister or father. I tried using BT Sync for that but the setup process was always complicated and it annoyed the crap out of everyone in the family so I gave up and started using email instead. ugh, email. AirDrop is cool, but that's an Apple only thing, and I'm the only one in my family that uses a Mac. Wouldn't it be cool if there was an app like AirDrop, but cross platform? \n\n##Enter Snapdrop. \nSnapdrop is everything I've ever wanted from file sharing. It's so amazing that you don't even have to download an app. There's literally no setup involved. You go to [snapdrop's website](http://snapdrop.net) on both devices, they both show up on each others screens, and you send files. IT'S SO SIMPLE AND SO AMAZING AT THE SAME TIME. \n\nSeriously, kudos to the [developer](https://github.com/capira12/). This is great work.\n"
        },
        {
            "id": 37,
            "title": "Frameworks (CSS & JS)",
            "date": "2015-12-29T15:00:38.000Z",
            "content": "\nThese past 2 days, I've been diving deep into CSS frameworks and how CSS works. Why? Well it ironically started with JavaScript frameworks. To be honest, I never really learned JavaScript. I learned Java, I already knew HTML and CSS, so I just started building JS apps and using tools like GitHub and StackOverflow to help me along the way, and so far it's worked out fine. It's helped me with building simple stuff like [I'm Crushing It](http://imcrushing.it) and smaller stuff within the app like animating text, getting twitter sharing to import stuff from the DOM, etc. It even helped me build out the PDF Magazine Reader on the [Rabelais website](http://rabelais.com.au) and a lot of other small stuff in the various websites I have built over the years. \n\nHowever, as I was reading through the documentation for [Vue.js](http://vuejs.org) (as I was considering it for future projects), I realised I didn't really know much about JavaScript basics. Therefore I spent the majority of last week (including most of christmas day) learning JS fundamentals (which to me feels a lot like Java) and getting the hang of that. However, as I was doing practice stuff on codecademy and watching Lynda.com videos, I stumbled across DevTips, a pretty cool youtube channel. Through that, I ended up watching some CSS videos and found some fascinating stuff about CSS that I never really had thought of before. This is gave me some inspiration to try and fix my website up a bit. I was getting pretty bored of the aesthetic and had known for a while that the CSS could do with some cleaning up. I was supposed to just spend an hour or two on it, move the about section from an individual html page to a section within the main website to make it a one-pager and change up the pictures and link colors a bit. Without realising, I had been sitting on the desk for about 5 hours and probably broken as much as I had fixed. On the plus side, the website looks a lot prettier now, has some nice colours, and I even figured out how to do the hyperlink text decoration style that [Wired does](http://www.wired.com/2015/12/goodbye-wearables-you-had-a-stupid-name-anyway/) that I love so much. Unfortunately, the website runs like junk on mobile, with scroll issues and page stutters. I've also realised that although parallax may look cool, it really isn't functional. \n\nToday, I've come away with an even greater appreciation for simpler and less overbearing, immutable CSS frameworks such as Bass CSS and Solid. I'm still going to continue working with Bootstrap, especially when working on projects for bigger clients. I don't think I'm ever going to work with [Materialize](http://materializecss.com) ever again. It's fine if you want to just stick to a pre-made template but building something out from scratch while trying to make everything feel cohesive is just a pain. Building a website out from scratch with something like Bass would give me a nice base to work on while still giving me the flexibility I need. \n\nIn the future, I would want my website to look similar to how I've got my blog set up now. Something clean and simple, where I don't need a fancily designed website to show off my skills, and my work can speak for itself. However, I'm merely in the infancy of my web development career and I still have a long way to go before I can reach that stage. \n\n####The week ahead.\nI've been reading up on SASS and JADE a lot today, and I'm going to spend the next couple of days doing more research on how they work and what their limitations are. I'm also interested in the Toast grid framework. Once my CSS urges are satisfied, I'd probably go back to the top and learn how to use Vue.js. GAH. TOO. MANY. TOOLS. Who am I kidding, I love tools. \n"
        },
        {
            "id": 38,
            "title": "Necessary Redesign.",
            "date": "2016-01-10T05:35:52.000Z",
            "content": "\nAbout a week ago now, [I shipped Simpledown](https://medium.com/@SnazzyHam/why-i-built-simpledown-750e5663bb1f#.hvd6geua7), a simple, web-based Markdown editor. I built it using Vue.js, based off a template that was in the Vue docs. However, it's been a week and therefore it was obviously the time to revamp the entire thing. I kid. \n\nSeriously though, I've spent this past week receiving feedback, as well as testing out the app for my day to day use. The more I used it, the more I found myself wanting to add features / make design tweaks that I couldn't, due to my limited knowledge of how Vue.js works. While I tried to read through the docs, I just couldn't get Vue to do what I wanted it to. At the same time, someone on reddit introduced me to [SimpleMDE](https://github.com/NextStepWebs/simplemde-markdown-editor). This immediately made me doubt everything I've done. Why? Because it's essentially everything I needed. Or at least I thought it was. The more I played around with it, I realised that if I integrated it, Simpledown would become a lot less simple. Completely diverting me from the initial aim of the project. \n\nHowever, I was still curious, and ended up finding this really nice markdown editor. Part of me wanted to shut down Simpledown altogether, and just redirect users to that app. However, it wasn't really an app. It was more like just a demo. So I ended up forking it, tweaking it, cleaning up the code, and I began trying to integrate it into Simpledown. \n\nAfter about 2 hours, I almost gave up. It seemed a lot simpler to just build an app from scratch based around the demo code, rather than trying to integrate it, but where's the fun in that? So I took some time, well a lot of time, and it is now `2:39 am` and I think it's pretty much ready. No Vue.js. No Frameworks (aside from Solid of course, which I'm actually starting to like and loathe at the same time). All in all, I really feel as though this update has taken Simpledown from an app I liked using, to an app I **prefer** using. Hopefully, that is the case for you too.\n\nI'm falling asleep. I've got the voices of Myke Hurley, Stephen Hackett and Federico Viticci blaring in my ears, but I'm still trying to write release notes. Those notes are below. Hopefully, update 1.1 has fixed more than it has broken. Hopefully. \n\n#### Update 1.1 Release Notes. \n\n<hr>\n\n- Added Syntax highlighting in the editor window. _(for headings and html)_\n- Added export HTML\n- Added some new shit\n- I can't even remember what I've changed. \n- I stopped using Vue I think?\n- ctrl-alt-shift (cmd-alt-shift) now brings up save menu.\n- pullquotes work better (aka they actually work)\n- It now immediately focuses on the editor when you bring it up.\n- It automatically saves your shit for you. \n- removed option to download as any extension, changed it to only download as markdown, keeping things simple.\n- the key to success is to have emoji support :key:\n- `inline code looks a bit prettier`\n- tab support, cause some guy on reddit asked for it.\n- drag and drop files to the app should open them? \n- You should be able to share the URL and have the receiver view your notes. keyword: **SHOULD**. \n\n###### Upcoming Features\n* Save to Dropbox (yes, still.)\n\n\n_A huge thank you to [jbt](http://jbt.github.io/)._\n"
        },
        {
            "id": 39,
            "title": "Why I built \"Simpledown\"",
            "date": "2016-01-09T19:28:11.000Z",
            "content": "\n![](https://d262ilb51hltx0.cloudfront.net/max/600/1*Q9fKPHj2zloHjl-Nufl-Kw.png)\n\nEver since I was introduced to Markdown a couple of years ago, I’ve been in love with it. I use it everywhere I can, and there are some really great Markdown editors out there.\n\nHowever, when I’m at university, I often have to work off the computers in the lab, which allow you to install your own apps but uninstall them on every logout, and often I’m scrambling just take down a few short notes, make a to-do list for the current task in class, or even just format an email. Most of the time, I really can’t be bothered logging in to Draft just to make a few notes that I don’t even want to save. I’ve spent a lot of time over the past year looking at web markdown editors that don’t require me to login, and I never really found one that was clean and barebones enough. All the ones I saw either had ads, or was over bloated with features. As time went on I just forgot about and used Notepad instead, even though it would’ve been nice to have something similar to that but with Markdown support.\n\nEarlier this week, I was browsing through the Vue.js docs, and I found the little markdown sample code, and I thought hey, that’s exactly what I want out of mine. So I just copied the code over, put it in a container so that it didn’t take up the whole screen and used it on my personal server for a few minutes.\n\nA couple of minutes later, I had the idea that it would be pretty neat if I could download the markdown file that I was writing, just in case I would ever need to. A half hour on stackoverflow later and I had a working save local feature. That’s when I decided to clean it up a little, mainly because I needed an excuse to give Solid a try anyway. I gave it a header, cleaned it up, put some intro text and now it’s here. Version 0.001 or whatever. I’ve been using it on and off for the past 2 days or so, and I’m happy with what it does.\n\nI’m adding a Save to Dropbox button, because that may come in handy sometime, and may add a feature that allows you to export the style to HTML, but I’m not sure if I want to include that or not, because I don’t want it to get too bloated.\n\nYou can access the app on Simpledown.co and give me your criticisms and feedback on [twitter](http://twitter.com/snazzyham)!\n\n---\n\n_you can find the code for Simpledown on my [GitHub](http://github.com/snazzyham)._\n"
        },
        {
            "id": 40,
            "title": "Unorganised Ramblings.",
            "date": "2016-01-28T16:15:52.000Z",
            "content": "\n> This post was supposed to be called \"Why I want to be a product manager\", but after reading it, it had barely anything to do with that. Therefore, I have changed the title to something a little more fitting.\n\nI started my first job at the age of 17. I had just graduated, and I didn't know a thing about how the world worked (_I pretty much still don't_). I thought I did, I thought my years at school and my many years of reading people's blog posts (this was pre-Medium years), had prepared me for what I was about to face. Boy was I wrong. \n\nMy first two weeks at the job were as expected. I got people coffee. I managed the petty cash. I sat there awkwardly and did things I was told to do. It wasn't much fun. I had to be there at 8am, 5 minutes later than that and I would have to endure a 2 hour lecture. I don't mean to diss my boss in anyway, he was a great guy and I learned a lot from him, but that's not what this post is about. Back to the story. \n\nSo after a while, my role became more related to business development and lead generation. Something I wasn't, and till today, am not good at. So I sat at meetings, I took notes, I followed up with current clients. All that was okay, untill one faithful day. It was around my second month at the job, and we were in a boring, run of the mill meeting with one of our clients, Car Keys. Everything was going fine, internally I was rolling my eyes at how boring all the ideas were. That's when Michael, one of Car Keys' co-founder's turned to me and said; \"What do you think?\". I gave him my idea, and thought nothing of the matter. Soon after, everything changed. I was cc'ed into more emails, more people were asking me things, even though I didn't know anything and none of my opinions made sense, shit was getting real. \n\nAbout a month after that, my job description changed completely. Yes, I was still mostly in meetings all day. However, this time around, I was more of a middle man. I was taking notes, not as \"meeting minutes\", but more as real fucking notes. I would go from meetings with clients, where they told me what they want, to meetings with designers and developers, where I told them what the client wants. \n\nThis may seem like I'm bragging about myself, but here's the facts. I didn't know anything, and if I was actually taking any decisions, everything would have failed. So why was I the one at those meetings? Simply, I spoke good English. The team was made up of 10 people, my boss and the CEO of the company, who was an American/British citizen, and 9 designers & developers, all Indonesian. Our clients? All foreigners. So essentially, the only reason I was in those meetings was because I could understand the point they wanted to make. I did that for about 6  months, and then I resigned, for a multitude of reasons. In those 6 months however, I learned a little bit about HTML, enough to throw in a few sentences like \"yeah we can do that\" or \"technologically speaking, that isn't possible\" during the meetings, but that was about it. I got a position at Tech in Asia, a website I was madly in love with, and I went to pursue my career as a technology journalist, a job that at the time I assumed was my dream job. *(It had always been my dream to work at The Verge, and I still want to work there, it's just a little different than before)*\n\nFast forward 3 years. I've completed 1.5 years at University, I've learned so much more about technology and myself, and I'm working as a Front-End Developer at one of the coolest agencies in South East Asia. I've built websites and apps and stuff, and I'm so excited, I just want to learn as much as I can, about everything that I can. Which is stupid, but I have a reason. \n\nIn order to succeed at what I do, I would have to be really good at one thing. I'd have to be fucking brilliant at CSS and JS to be a decent *Senior Front-End Engineer*, or I'd have to be ace at PHP or Ruby to be a good *Web Architect*. But what happens if I want to learn about _**everything**_. Well, then I won't be really good at one thing. However, if I have an understanding of all the technologies, I would be able to help people build things by giving them direction and advice. Now, this is me thinking way ahead, because I'm only 20. I'm no where near experienced enough to be a manager, shit, I'd be lucky to get a fucking internship somewhere, but if I work hard enough, I can make this future a reality. Remember how I said it was my dream to work at The Verge, well, I still want to work there, but not as a journalist at The Verge, I want to work at Vox Product. I love writing, I love tech, I want to help build the tech that helps journalists and writers, the tools that let them tell their stories in new ways. Right now, Vox Media's product division is doing things that are years ahead of the competition, and hopefully one day, I'll be able to help them build the future of journalism.\n"
        },
        {
            "id": 41,
            "title": "Windows Woes",
            "date": "2016-01-31T12:45:02.000Z",
            "content": "\nIt's fascinating how setting up a dev environment on Mac and Linux take about a minute or so, and trying to do the same thing on Windows can take hours. Sure, at the end you get the same result, but getting there is so much faster on a Mac. \n\nI've spent the most of today trying to get Grav, a flat file PHP based CMS, set up locally on my computer. To do that, I would need a web server. On a Unix machine, it's easy as can be. I just have to type `apache start` and I'm good to go. On Windows? Well I tried installing XAMPP, but that had problems with getting access to port 80. So I was told to delete something from *services.msc*. To bad that thing I was told to delete didn't exist. So, I decided to try IIS with PHP or whatever. Now, this isn't some janke 3rd party software. This is official Microsoft software. It refused to install. Rather than going through that whole time waste of trying to figure out how to fix those errors, I decided to just fuck it and install fedora instead. \n\nWhat does that say about windows, that a developer would rather install a completely new operating system than deal with its garbage software issues. \n\nI love Windows 10. It's been my favourite iteration of the OS, and I've been using Windows all my life. It's way more functional than windows 7 and it even looks bloody gorgeous. However, the more I've been playing around in the world of web development, the more I've grown annoyed with Windows and its bullshit. \n\n I can't believe I'm saying this, especially with all the advancements Microsoft made in Windows 10, but Windows, *why do you suck so much?*\n"
        },
        {
            "id": 42,
            "title": "Using Sketch as a Developer",
            "date": "2016-02-01T10:07:30.000Z",
            "content": "\nI've never really been much of a graphic designer. I do design, but my designs are more simplistic and minimal kinda designs. Stuff like [the Simpledown logo](https://www.dropbox.com/s/urs8of17gkumbf8/Simpledown.png?dl=0) or the other [designs on my portfolio](http://snazzyham.com/portfolio.html). I got into design when I needed a logo and some other graphics for my YouTube channel, and I sorta picked it up from there. I've done some contract work for clients, but never anything huge like brand identity or whatever. \n\nWhenever I've needed to do any design however, I've used Photoshop. Be it a design for a website I'm working on or whipping up a quick logo for a friend or something, I use Photoshop. I'm comfortable with it, and coming from Adobe Premiere Pro, it kinda just came naturally to me. Over the past year or so, every designer I've interacted with on the internet or listened to on a podcast has sworn by Sketch, calling it the photoshop killer. It seemed really cool, so I bought it using a discount code I found somewhere. I tried playing around with it, but since then, I never really had any use for it. \n\nAbout a month ago, I had a friend ask me to do a logo for this new company he was planning on working on. So I launched Sketch, having no prior knowledge of it, and I really wasn't sure how to do many things. So I quit Sketch and whipped it up in Photoshop. \n\n![](http://puu.sh/mRE6i/f9dfc193cc.png)\nToday, I had to make a wireframe for a website, and as much as my instict was pushing me toward the Ps icon, I decided to do it in Sketch. I have to say, I'm really quite impressed. Sure I could have done the same thing in Photoshop, but using Sketch was just more fun. It loaded instantly, so I could immediately get my ideas down, it was intuitive and did everything I needed it to. \n As I focus more on development, I could really see Sketch being an important tool in my workflow, for wireframing and outlines and such. Maybe as I do more UI and design stuff I'll use Sketch for that too. I know Sketch isn't really made for wireframing and there are many more appropriate tools out there, with a lot more features, but at the moment, it does what I need and it lets me do that fairly quickly, so I'm really liking it, for now.\n"
        },
        {
            "id": 43,
            "title": "We're re-building the website, again!",
            "date": "2016-02-03T06:03:59.000Z",
            "content": "\nWhen I started working at Percolate about 2 months ago, amongst the tast of building out Spencer (and later on, [I'm Crushing it]), one of my primary tasks was re-building the website. Over the past 2 months however, as we've been busy setting up the projects I previously mentioned, Donda, our best practices and SOP blog and some other internal stuff, we kept going back to the website and ignoring it after a while. \n\nIt is due to this inconsistency, that we've ended up re-building the website 3 times. We have 3 working prototypes, 1 on Squarespace, 2 fully custom sites that I built, all that could potentially be our final website, but we've decided not to use any of them. They're very basic, and boring. The art is great, it's bold and creative. However, the layout, I don't know. There's just something about it. \n\nMost people would think that would be getting me a bit down. Having to start a project and trash it a few weeks later. However, I'm excited to start this next project. Here's why. \n\n### I'm not only doing dev work\nMy last post was about [how I finally got the chance to use Sketch]. I've used it every day this week, and I'm getting so much more used to it. I was able to build an entire wireframe in the time that Photoshop would take to load. Basically, it made my workflow really quick, kept file sizes small, and did most of what I needed it to do. Keyword: _most_. I imported an image that had a solid background, and usually I would just open it in a new tab on Photoshop and use the magic eraser to make it transparent and it'd be done. However, I'm not sure if Sketch can do that. If it can, I haven't figured it out yet.\n\n### New Technologies.\n\nThe past 2 site revisions were built atop of bootstrap. However, I soon realised that I didn't even need all of bootstrap. I really was only using the navbar (because of the collapsible dropdown on mobile) and the grid. So I've decided, no bootstrap for this project. I'm still battling between actually using a framework such as Zurb Foundation, or just going with Dan Eden's Toast Grid, seeing as I seem to be a fan of everything else he does. Flint also seems like a fascinating grid, but I still have time before I decide on that. \n\nWhat I'm sure about right now, is that I'm going to be using Jade and Sass. Being given the opportunity to build this out from scratch, I know that both Jade and SASS will increase my working speed by a ton (or at least I think it will, from what I've learned about it so far). I'm also gonna use stuff like autoprefixer so I don't have to worry about -webkit- and -moz- and all that nonsense. \n\nAll in all, tis a good time to be alive my fellow humans. \n\nPeace out. \n\nSoham.\n"
        },
        {
            "id": 44,
            "title": "Have I become dependant on CSS Frameworks?",
            "date": "2016-03-03T01:06:25.000Z",
            "content": "\nThere's no denying it, CSS frameworks are great. Some might say that they bloat up websites, and have way more content than you actually need, but others will tell you that they're a blessing. I've been using CSS frameworks in every project I've done since 2015. Well, all projects except one, Spencer. Spencer was more mobile centric, and didn't have any CSS elements per-say, as all it's design elements were designed in house at Percolate Galactic. \n\nBack to the main part of this story. I'm currently sitting in a class called CSE2ICE - Internet Client Engineering. The goal for the end of this class, to build a website. Ironic. I know. However, this website would have to be built from scratch. That includes all my own CSS. It's not impossible, and I'm definitely excited. Who knows, by the end of this class I may actually end up building my own CSS framework. OH MY GOD THAT'S WHAT I'M GOING TO DO. I'M GOING TO BUILD A CSS FRAMEWORK. \n\nI am very excited. Also, I've got Mitch and Phil on my team, so there should be some fun coding sessions. \n\n"
        },
        {
            "id": 45,
            "title": "Baby Steps, Maybe?",
            "date": "2016-03-16T09:39:42.000Z",
            "content": "\nSo a while back I wrote a post where I was really looking forward to trying out Jade and SASS for working on the new company landing page. However, once we finalised what the design would look like and it was time to start building, I ran into a lot more problems than I thought I would. \n\nPreviously, I had planned on using Jade + SASS, and was going to build it on Zurb Foundation. However, an hour into the project, I knew that wasn't going to work. \n\nHere's the problem, I found myself looking up the basics a lot. Compiling the Jade and SASS wasn't too bad since I had Prepros running in the background which worked great. However, I wasn't accustomed to foundation, so I was on the docs a lot. On top of that, I was looking up a lot of Jade and SASS basics as well, so I was spending a lot of time doing that. \n\nI decided to scrap all that, well most of that, and go back to basics. I went back to Bootstrap 3, because that's what I know how to do. I would have preferred using Solid, but at the end of the day I'm not that experienced in it and it would have ended up like Zurb again. In addition to that, I recently learned of an Atom plugin that adds bootstrap shortcodes, which makes workflow much faster. Bootstrap also has more features. \n\nAs much as I would have liked to use Jade, the bootstrap shortcodes actually make it seem faster than working in Jade, so I decided to opt out of that. I am however, still using SASS, well SCSS. I really like SASS, but I soon realized down the road, there might come a time where I wouldn't be the only developer working on this website, and it would be unfair that the next developer would have any clue about SASS, so SCSS would be a lot more familiar to them. \n\nSo yeah, baby steps with SCSS now. I even stopped using Prepros, as I wanted to learn how the compiling process works myself, so I'm using gulp to convert my sass into css. Which is nice, cause now I'm not dependent on a 3rd party app. \n"
        },
        {
            "id": 46,
            "title": "SASS is really, really good.",
            "date": "2016-03-24T01:17:40.000Z",
            "content": "\nHey you, yes, you there. you see this blog you're reading this post on? Does it look different? It does doesn't it. Previously, it was on a dark grey background, with white text. I really liked it, but a lot of people didn't. So I thought, why not try going back to my old white & green colour scheme. The thing is, my CSS was a mess. So, instead of catching up on lectures last night, I decided to re-factor my entire CSS as SCSS. \n\nThe first time I had tried using SCSS was on the new Percolate Galactic website, and I loved how much faster it made everything. To be honest, I'm not even using it to its full potential. I use SCSS for two main reasons, Nesting and Variables. With variables, I don't have to keep copying and pasting my colour code, which has saved me an insane amount of time, also, if I ever want to test a different colour scheme out, I just need to change one line of code. \n\nHowever, probably the thing I used most for this website, was nesting. I never actually learned CSS properly like through a course or whatever, so I'm still not confident when it comes to _\"change the colour of all the links within this div only\"_, and with nesting it makes that so much easier. I used this a lot because I wanted my links on my masthead and footer to look different to body links. \n\nLong story short, SASS / SCSS is really really good, and I can see myself using it on a lot more projects from now on. \n"
        },
        {
            "id": 47,
            "title": "The Case for Modular and Functional CSS",
            "date": "2016-05-25T01:11:37.000Z",
            "content": "\nOver the past couple of years, many buzzwords have arisen around CSS. Immutable, Functional, Modular, and they all pretty much mean the same thing. Write CSS as clean and simple as possible, without trying to over complicate it and turn it into a programming language. I've been trying to write clean and functional CSS for about the past year now. I try to make sure all my class names make sense and a re-usable, and also aren't to broad. \n\nOne thing I found myself doing a lot when I first started working with frameworks was that I was over-riding classes a lot. \n\nTake this block of code for example;\n\n`.btn {\n   background-color : 777;\n}`\n\nIn the above code, `.btn` is a class that already exists in the framework, and I was overriding the whole class to simply just change the colour. Since then I've begun writing more functional code, in the sense that instead of modifying the entire button class, I would just create a new class called `.gray-background` and apply both the classes to the element.\n\n> \"Don't be afraid to use multiple classes\" - Mark Otto ([@mdo](http://twitter.com/mdo))\n\nOnce I was introduced to functional css, I was hooked. I started looking into more ways make my CSS more functional, and that's when I found out about immutable css. Essentially, the idea behind immutability is that you should have a seperate class for everything you may need, such as padding and margins. [Paul Straw](http://paulstraw.com) said this on a  podcast once and I felt like it summed up immutability perfectly; _\"make it so that you never have to write CSS again, and you just have classes that you re-use all the time\"_. I always thought that was a really good ideology, but it never really hit me on how useful that could be until yesterday. \n\nAs part of a year long subject, a couple of my friends and I have to build a Public Transport app that's unique to La Trobe University. We're halfway through the subject and just completed our functional prototype for pulling API calls and parsing them into readable data. My work was mostly on the front-end and user experience, so I've been doing a lot of research and wasn't really working on the functional prototype apart form a little bit of PHP stuff. Yesterday was our client presentation and a couple of hours before it I was looking at our prototype and.. well I have no words, I'll just let you [look at it yourself](http://metrobe.imcrushing.it). Being in charge of design for this project, I wasn't going to let something with our name on it look like that. So I FTP'ed up to the server, copied over the latest minified version of [BuzzFeed's Solid](http://solid.buzzfeed.com) and set about cleaning it up. Within 15 minutes it [transformed into this](http://metrobe.imcrushing.it/styled.php), all with me writing a total of 0 lines of CSS. Being a framework built with the idea of immutability, Solid worked brilliantly. All I had to do was pop in a couple of classes, clean up the code and the site was looking, well I wouldn't say beautiful but much neater. \n\nFrom past experience I knew a project like that shouldn't take much time, but when I learned it could be achieved in a matter of minutes, all without writing a single line of CSS, my mind was blown. \n\n## Thoughts on SASS so far. \nWhen I have been writing CSS, I've been using SASS exclusively, ever since I first posted about it. However, I always felt like I really wasn't taking proper advantage of it. I'm still unsure what words like base class and mixins mean. I really only ever used SASS for nesting and variables, which has worked great for me so far. I've always felt like I should try and use SASS more, and try and squeeze the potential out of it, but it's been pretty daunting. However, watching Mark Otto's [talk on Mdo-ular CSS](https://www.youtube.com/watch?v=UeK2czjUGCo) <small>clever pun btw</small>, I'm left with the impression that the way I use SASS isn't really a bad thing after all. I still might try to learn more about it, just for the sake of learning, but at least now I'm more confident in my SASS abilities. \n\nAs it always is with most of my blog posts, I jumble around a lot of content and rarely ever have a decent conclusion, so instead I shall leave you with this gif. Have a nice day. \n\n<center><iframe src=\"//giphy.com/embed/5pxnxdzdZfXFK\" width=\"480\" height=\"360\" frameBorder=\"0\" class=\"giphy-embed\" allowFullScreen></iframe><p><a href=\"http://giphy.com/gifs/css-5pxnxdzdZfXFK\"></center>via GIPHY</a></p>\n<hr>\n<small>p.s., I'm on dribbble now, and would love if you came and checked out [my profile!](http://dribbble.com/snazzyham)</small>\n"
        },
        {
            "id": 48,
            "title": "More Fanboying over Facebook",
            "date": "2016-06-08T06:18:25.000Z",
            "content": "\nI've written before about the weird obsession I have with wanting to work for Facebook. No, not because of all the perks and stuff. More so, because of the ethos and the way anyone who's ever worked at the place just talks about it with so much passion. It's hard to explain, but read this [brilliant article about Facebook's determination to kill Google Plus](http://www.vanityfair.com/news/2016/06/how-mark-zuckerberg-led-facebooks-war-to-crush-google-plus) and you'll kinda get the idea.  \n\nThis is a short blog post, and I'm pretty much using it as a place to store this link so I can read it again later. \n"
        },
        {
            "id": 49,
            "title": "My first steps with Gulp",
            "date": "2016-07-05T05:01:00.000Z",
            "content": "\nI've just spent the last 2 days working with Gulp, and I have a lot of thoughts. Granted, this wasn't my first time using Gulp (I had used it previously to compile SCSS on the Percolate website), but it was my first time actually trying to understand what it does instead of just copying code off the internet.  \n\n### What the heck is Gulp?  \nIt's hard to explain, but essentially, Gulp is a _'build tool'_, that runs in the command line _(or terminal)_, that automates some stuff for you. Therefore, running a simple line of `gulp`, let's me compile my SCSS and run a bunch of compression and compilation tasks and what not.  \n\nMy foray into this whole Gulp rabbithole started when I was following [this online tutorial](http://andrewhfarmer.com/build-your-own-starter/) to build your own starter kit. As I was going through the steps, I realised how important the concept of a starter kit was, but that I didn't really need all the fancy webpack, babel and react stuff, because I don't even know React yet. So this morning, I created a new branch based off that one, removed all the bloat I didn't need, added browsersync as a web server, and I'm pretty happy with it.  \n\nEssentially, this is what I'm using gulp for; compile my SCSS + Buzzfeed's Solid CSS framework into one CSS file, and serve it on a web server. That's pretty much it actually. Wow, I just spent a lot of time to do something that small. hmm.   \n\nI plan to add some stuff to my Gulp process, such as Jade compilation if I ever end up switching to Jade, Jekyll stuff, because I plan to learn Jekyll and some small things such as image compression and what not.  \n\nYou can view the starter kit I'm referring to [here](https://github.com/Snazzyham/webStarterPack/tree/basic). \n\n"
        },
        {
            "id": 50,
            "title": "Setting up skeleton files with Vim",
            "content": " \nVim, for those of you who use it _(I mean if you don't use it this article probably is of no use to you)_, is actually a pretty powerful tool. I've been using it on and off lately, and I'm still trying to get the hang of it myself.   \n\nI've been trying to make the switch from Atom, but one of the main things that holds me back is that I'm a lot faster in Atom. So I decided that step by step, I'm going to start trying to figure out how to do stuff in Vim that I usually do in Atom, the first of those was skeleton files. What I mean by this is that usually when I'm starting up an html file, I type `html5-` in Atom, hit enter and I get this;\n\n```html\n<!DOCTYPE html>\n<html lang=\"en\">\n  <head>\n    <meta charset=\"utf-8\">\n    <meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">\n    <title></title>\n\n    <!-- Bootstrap -->\n    <link rel=\"stylesheet\" href=\"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.5/css/bootstrap.min.css\">\n    <link rel=\"stylesheet\" href=\"https://maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css\">\n\n    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->\n    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->\n    <!--[if lt IE 9]>\n      <script src=\"https://oss.maxcdn.com/libs/html5shiv/3.7.2/html5shiv.js\"></script>\n      <script src=\"https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js\"></script>\n    <![endif]-->\n  </head>\n  <body>\n\n    <!-- jQuery (necessary for Bootstrap's JavaScript plugins) -->\n    <script src=\"https://ajax.googleapis.com/ajax/libs/jquery/1.11.3/jquery.min.js\"></script>\n    <!-- Include all compiled plugins (below), or include individual files as needed -->\n    <script src=\"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.5/js/bootstrap.min.js\"></script>\n  </body>\n</html>\n```\n\nThat comes as part of the `html-bootstrap` extension, and it really is a great starting point _(although I don't use Bootstrap anymore, I just delete the bootstrap links and throw in a link to [Solid](http://solid.buzzfeed.com))_. I wanted to figure out how to do this in Vim, but didn't really find many tutorials out there, so I had to ask a couple of people, and this is what I found out. By using the `BufNewFile` command and calling a function that appends the code you want, you can have Vim automatically add code to any file you create with a specific extension, in this case, `.html` files. Here's what it looks like; \n\n```vim\nautocmd BufNewFile *.html ks|call HTMLHeader()|'s\nfun HTMLHeader() \n    call append(0, \"<!DOCTYPE html>\")\n    call append(1, \"<html lang='en'>\")\n    call append(2, \"  <head>\")\n    call append(3, \"    <meta charset='utf-8'>\")\n    call append(4, \"    <meta http-equiv='X-UA-Compatible' content='IE=edge'>\")\n    call append(5, \"    <meta name='viewport' content='width=device-width, initial-scale=1'>\")\n    call append(6, \"    <title></title>\")\n    call append(7, \"    <link rel='stylesheet' href='style/solid.css'>\")\n    call append(8, \"  </head>\")\n    call append(9, \"  <body>\")\n    call append(10, \" </body>\")\n    call append(11, \"</html>\")\n```\n\nWant to do this for another type of file? you just have to replace the `*.html` on the first line with the extension that you want. Of course you could bypass this altogether by setting up a webStarterKit, but this works for any sort of file you may have, and is pretty flexible.  \n\nI hope this tutorial helps someone, and if you know someone who's just starting off with vim, link them to this, you never know when it may come in handy! \n"
        },
        {
            "id": 51,
            "title": "Simpledown 1.2",
            "content": "\nWhat seems like a lifetime ago now, I pushed simpledown to the web. Simpledown was born out of a need for a simple text editor, with markdown support, that would let me immediately pull up a browser and start writing down my thoughts. Having a simple, browser based (due to constraints that I had [previously written about](http://snazzyham.com/2016/01/10/necessary-redesign/)) markdown editor was something I had always wanted, but was never really motivated to build. That is until I found the example in the Vue.js docs. I basically took that version, wrapped it in some html and css, and threw it onto a server. One day into using it, I hated it. So I scrapped the entire thing. However, having already had a taste of what I was looking for, I sought out some github repo's that would help me do what I want. A day or so later,  I had a better, more usable version. And that's how Simpledown 1.1 was born.  \n\nSince then, I've been making a few small changes to the app, but never really anything noticable. The biggest change came in around March, when I adapted the layout to allow me to keep the app open side by side with another window on a smaller display, aka to let me take notes in class. However, as time passed, as much as I wanted to use Simpledown, I just stopped. I instead moved back to Mou on the mac _(and macdown since then)_. \n\nIf not for any specific reason, its just that I didn't really take notes at the lab as much as I used to, and didn't find myself needing a browser based markdown editor. This morning, when I opened up Simpledown, after a regrettably long amount of time, a few things bothered me. To preface this, you should know that in the past month, I've begun using Vim exclusively for all my programming work, and there's a lot I've gotten used to. I'm used to using vim commands and shortcuts to moving around a file, and found myself constantly hitting escape, V and $ in the textarea. Another vim command I use often is Ngg (skip to line), which even if I did have vim commands in Simpledown would be hard, because there are no line numbers shown. Also, one of the biggest feature requests I've had from people who use the app was a dark theme. _The people I refer to, well person, singular, is myself. I found a to-do in my list app stating \"make a dark mode for simpledown\"_. So today, I am proud to bring you, if there even is a you, Simpledown 1.2! We've got it all. Line numbers, vim commands, dark mode and a few small improvements, that go toward making this app a little more usable. It's not good enough to become a daily thing, but its close. I can feel it. A full list of changes can be found below.    \n\n\n## Changelog \n- Added Dark Mode\n- Added Vim Commands\n- Show Line Numbers\n- Save to Markdown // Save to HTML now prompt the user for a filename rather than the annoying untitled.md or untitled.html it kept doing\n- It works well in split screen mode now _(actually an old update but never announced)_\n- Changed font to Roboto Mono\n\n### What's next \n- Dropbox _(YES, I know. Still)_\n- Full Screen Mode \n- Read Jekyll front matter \n- _(maybe?)_ make it a progressive web app and make it usable on mobile?\n- Clean up the codebase cause its ew."
        },
        {
            "id": 52,
            "title": "Why is Everyone Obsessed With Writing CSS as JavaScript?",
            "date": "2017-03-29T12:51:00.000Z",
            "content": " \n\nThere comes a point in many web developers lives, where they've spent the last two or so years moving from stack to stack learning the new hottest thing in tech, trying to see if its right for them, only to get insanely overwhelmed by all these new technologies and just break down and stick with one. I wouldn't say I've hit this point yet, but I have hit a pretty different one. I've reached the stage, where although I'm excited to learn the new hotness, I'm skeptical on some of the opinions that its community may hold. \n\nI love CSS. This maybe an unpopular opinion, but it's true. I love writing CSS. I laugh when people call it a _\"Cascading Shit Show\"_, but deep down, be it writing or debugging, I love it. Which is why it makes me sad that everyone is trying to replace it. \n\nFor the past couple of months, I've been hearing terms like `css-in-js` and `css-modules` thrown around, but I never really knew why anyone would want to use it. I write my CSS the Atomic way, ala [jxnblk](http://jxnblk.com) and [mrmrs](http://mrmrs.cc) amongst many others, and I think it works great. It's performant, clean, reusable and fast to work with. Which is why, when I started learning React, I decided to just use regular CSS and ignore the whole argument for breaking down your CSS and using it as JavaScript and what not. I read a couple of articles about it, but I just really couldn't bring myself to ditching CSS, not when I was having this much fun with it. \n\n![](https://i.ytimg.com/vi/Zpi7qQaB0jU/hqdefault.jpg)\n\nA couple of months passed, I had taken a break from React to get into Vue, because, once again, it seemed like the new hotness, plus I wanted to play around with it. I was still using CSS the way I loved, Atomically, and everything was swell. Then came a bigger challenge, we built [oddamatic](https://oddamatic.com) as an experiment to see what we could do with web technologies, and it got a good enough reception where we decided to turn it into a mobile app. However, we wanted it to run on iOS and Android, and I'm the only developer on the team, so we didn't really have the resources for me to learn Swift and Kotlin, or whatever it is Android Dev's swear by these days *(nb: I'm an Android loyalist, I just don't like Java)*. React Native seemed like the best option, because I was pretty familiar with React and I loved the way it worked, and I was pretty burned out on the Ionic framework and Angular, from when we built [Spencer](http://spectacularspencer.com). Also, `create-react-native-app` had just been announced, so there really was no better time. \n\n### Here comes the gotcha. \n\nYou __*can't*__ use CSS in React Native 😥. This meant it was finally time to start looking into these CSS in JS solutions or whatever. Here's how it went. \n\n### The Default Method - Objects, or whatever. \nTo learn React Native, I decided to take a course on Udemy. Mostly because Udemy sent me an email and I was tempted by the supposed 80% discount, which seems to have been going on since I signed up for Udemy years ago. I'm not knocking on the teacher here, because he's a fantastic teacher and explains it really well. However, he did choose to go with the traditional way of styling in react native, which makes me so so sad. \n\nThis method, takes writing CSS, and turns it into javascript objects. With properties using camel case instead of kebab case, and commas instead of semicolons. Here's an example from the React Native docs;\n\n```js\nimport React, { Component } from 'react';\nimport { AppRegistry, StyleSheet, Text, View } from 'react-native';\n\nclass LotsOfStyles extends Component {\n  render() {\n    return (\n      <View>\n        <Text style={styles.red}>just red</Text>\n        <Text style={styles.bigblue}>just bigblue</Text>\n        <Text style={[styles.bigblue, styles.red]}>bigblue, then red</Text>\n        <Text style={[styles.red, styles.bigblue]}>red, then bigblue</Text>\n      </View>\n    );\n  }\n}\n\nconst styles = StyleSheet.create({\n  bigblue: {\n    color: 'blue',\n    fontWeight: 'bold',\n    fontSize: 30,\n  },\n  red: {\n    color: 'red',\n  },\n});\n\nAppRegistry.registerComponent('LotsOfStyles', () => LotsOfStyles);\n```\n\nSome of my gripes with this; \n- You have to store it in a variable, and type the variable name over, and over, and over. \n- it tries to look like CSS, giving you that tiny sense of hope, before it comes outta nowhere with the right hook\n- Leaving React Native aside for a minute, if you use this method, or a similar method of writing inline styles in plain React, you miss out on media-queries and pseudo classes. Something as simple as a hover would either require you to import another library or writing a function. \n\n### CXS  \nNow, it's no secret that I'm a huge fanboy of Brent Jackson, so when I found out he created something called CXS for handling styling in React, I thought I'd give it a shot. If I'm being honest, I still can't really tell what CXS is. From what I gather, it lets you write CSS in JS, and then abstracts it into regular CSS, which seems to be performant and reduces _'deduplication'_. Here's a code example from github. \n\n```js\nimport React from 'react'\nimport cxs from 'cxs'\n\nconst Box = (props) => {\n  return (\n    <div {...props} className={className} />\n  )\n}\n\nconst className = cxs({\n  padding: 32,\n  backgroundColor: 'tomato'\n})\n\nexport default Box\n```\n\nThe problem with CXS for me specifically, is that I don't realy understand it, and also, it uses JS objects, once again. Also, I'm not really sure if this would work with React Native. It probably doesn't. At this point in my research, I couldn't really tell how I felt about this whole inline styles and separation of css for each component. Questions I had;\n>  _\"How is this more performant? What if you want to reuse styles? Are you not supposed to reuse styles? but isn't that what atomic css is all about?\"_ \n\n### styled-components &#128133;\n\nAfter a lot of contemplating and research over multiple other styling solutions for React Native, I decided to go with `styled-components`. Styled Components removes the issue of mapping between components and styles, coming from the idea where if we're going to write our CSS inline anyway, why do we still need a format of mapping our CSS to our components. \n\nI have to admit, looking at styled-components at a glance, it does look a little odd, but once you read the github README, it actually makes a lot of sense. It also works on both React and React Native, so if I get used to it enough with React Native, I could easily start using it in my next React project. \n\n```js\nimport React from 'react';\n\nimport styled from 'styled-components';\n\n// Create a <Title> react component that renders an <h1> which is\n// centered, palevioletred and sized at 1.5em\nconst Title = styled.h1`\n  font-size: 1.5em;\n  text-align: center;\n  color: palevioletred;\n`;\n\n// Create a <Wrapper> react component that renders a <section> with\n// some padding and a papayawhip background\nconst Wrapper = styled.section`\n  padding: 4em;\n  background: papayawhip;\n`;\n\n<Wrapper>\n  <Title>Hello World, this is my first styled component!</Title>\n</Wrapper>\n```\n\nOne thing I really love about styled-components is that it lets you write the CSS you've always known and loved, and also does nifty things like automatic vendor prefixing. \n\n### Concluding Thoughts\n\nAt the end of the day, I still prefer writing CSS the Atomic way. However, if and when the time comes for me to move on from good old CSS, I'm probably going to use styled-components. \n\n\n"
        },
        {
            "id": 53,
            "title": "Separation of Concerns, even in personal wesbites.",
            "date": "2017-08-12T13:43:00.000Z",
            "content": " \n\n_**disclaimer:**_ _I tend to write a lot more than necessary, especially when I start writing. The real thoughts of this blog post start under the title that says **NOW**. Thanks._\n\nI've long been a believer of the idea that we should decouple our frontends from our backends. I've built multiple all inclusive apps, and since last year have transitioned to separating my concerns, after finally learning what REST API's were and how they worked. I'm not going to go into detail about why I think that way of thinking is better for big projects, apps and services, because frankly speaking, you can find a lot of resources on the web that will explain it way better than I can. \n\nOne area where I haven't seen this concept is when we talk about personal websites. Partly, that's because personal websites are so varied in the way they're built, updated and even purposed. Some people use their personal website as a showcase of their skills, some see it as an online resumé and portfolio, while others just see it as an \"about me\" of sorts. Some use just a blog, because they believe that their thoughts are where their value is. No matter which category you fall in, there's probably a website engine or CMS out there for you. Now I can't speak for all of them cause I haven't tried _\"every\"_ system out there, but I haven't had the best experience with these platforms. To explain it clearer to you, below is my website journey;\n\n# My Website Journey\n## 2012\nI didn't know how to code. Hell, I didn't even know I wanted to code. At this point I still thought I would go to film school. One thing I did like doing however, was writing. TechnoBuffalo was my bible at this time, and writing about tech is all I wanted to do. I started a blog on blogger called TechnoCastle (inventive and original, I know /s). 6 months later I wanted to change my theme and blogger didn't have the best selection, so I moved to WordPress.com. I was happy with it. \n\n## 2013\nLate 2013, to be specific. I had just left my job at an e-commerce services company where I worked on the admin and management side of things, but had learned a few things about CSS and UX best practices from the people there and I wanted to put my skills to the test. I got a server and installed wordpress on it and got customising. It was bad, but I was happy with it. \n\n## 2014 \nTechnoCastle was fine on wordpress, but I wanted a personal website. I had taken an introductory HTML and CSS course on Codecademy, but I wasn't skilled enough to build my own website from scratch. I wanted something like Squarespace and Tumblr, where I could modify the CSS if I wanted to, and found Strikingly. It was great. \n\n## 2015  \nI had gotten into coding a bit more, and felt like I needed a website built from scratch. Mostly, I found Materialize.css while browsing around and wanted to play around with it. However, I also wanted to blog about my coding journey, so I started a Ghost blog on a subdomain (and retired TechnoCastle) and was fine with that, but it felt really weird. When people went to my blog, it looked nothing like my website. \n\n## 2016 \nMy hosting provider was a shady bloke who I'm pretty sure was siphoning server space from his employer, and sent me an email saying that Ghost, which was powered by Node, used way too much processing power and that he had to shut me down. I decided that paying for hosting for just a blog wasn't worth it, and I had just heard about Jekyll and Github pages. I needed something quick and temporary, I was busy with university stuff and for some reason couldn't stand the thought of not having a website. I found a theme built by someone I really look up to - [John Otander](http://johnotander.com/) - and forked it, customised it a little and threw it up. However, here was a big issue. My ghost blog had exported my old posts as CSV. Maybe there was a JSON option, I don't know. Anyway, I had to manually copy and paste the blog posts into markdown files, add the Jekyll front-matter manually and I basically did that for 30+ posts. It took me quite a while. Maybe that's the reason I'm still using that Jekyll website at the moment, because the process of exporting the posts was so painful. \n\n# _NOW_\n\nIt's now **August 2017** and I'm finally planning on building a new personal site. I've been thinking of it for a while, but I've been putting it off each time. One thing I know I'm not going to use is Jekyll. The process is just such a pain. Each time I have to write a new post, I have to format it with the date and slug as the title first (which is formatted in the American way so it always takes me a bit) and then rebuild the website and check to make sure it looks right and then push the website up to the server. It really isn't the most efficient. \n\nI had a bunch of ideas for a new website. Maybe a terminal style thing, a little like a mix of [David's Workshop](http://davidsworkshop.org) and [Jon Gold](https://jon.gold)'s websites. Then I thought, maybe just go back to Ghost and have an easy place to blog. The problem with that is, if I ever wanted to move away, exporting posts will be another pain. Then I thought of doing what Brent Jackson does, and keep a simple blog powered by Jekyll (in my case I would use Gatsby because of React) separately, and that way whenever I change my personal website - which happens often - I wouldn't have to worry about changing the blog. A sort of idea of decoupling the blog from the main website. It was at that moment that I took that idea and turned it on its side. What if, instead of decoupling the two full systems from each other, I decouple the frontend from the back? \n\nServices like [json-server](https://github.com/typicode/json-server) make it stupidly easy to get a REST API from just a json file sitting in a directory. I could host that on [Now](https://now.sh) and not need to worry about pushing up to a server at any time because it's literally just three letters that I need to type, and if I ever want to change the frontend, which I'll probably want to do often, I can just leave the API as is. The only issue would be compiling the markdown to JSON for use with json-server but I'm sure I could build something that just converts all the markdown to JSON and formats it the way json-server needs. \n\nSo far, these are my thoughts. If it all works out well, my next blog post will go straight into the API, instead of this Jekyll blog, which has served me well while it lasted. \n\nSigning off for now,  \nSoham"
        },
        {
            "id": 54,
            "title": "What does it mean to be a Designer?",
            "date": "2018-01-08T14:09:00.000Z",
            "content": " \n\nWhat's the first thing that comes to your mind when you think of the title \"Designer\". Chances are, you probably thought of someone who works with graphics or possibly even interfaces. It's 2018, and the word design itself is synonymous with the concept of art, something relatively visual and, for the lack of a better word, pretty.  \n\nHowever, I'm starting to believe that that's an issue. Not everything that needs to be designed has to be visual. UX Designers are often confused with UI Designers, and although a lot of UX Designers are excellent at creating interfaces, it's more of an addition to their skills rather than being a requirement for UX. Personally, I believe UX has a lot more to do with research and communication, and a lot less to do with choosing the right border radius for a button or understanding [the 8pt grid](https://spec.fm/specifics/8-pt-grid) _(althought if you do want to understand the 8pt grid, that blog post by Bryn Jackson is very, very good)_. \n\nI'm not saying anything like \"no one knows what design is\" because to be honest, I don't even know what a design is. In Indonesia especially, the perception of a designer is someone who works in Figma or Photoshop. However, I would say I'm a designer, but my preferred design tool is [Gliffy](https://www.gliffy.com/). I may not understand color theory or know how to illustrate, but I do know my way around [UML](https://en.wikipedia.org/wiki/Unified_Modeling_Language) and Class Diagrams. I'm not the best at visuals, but I would say I'm pretty darn good at designing a database with SQL or crafting up an ERD (Entity Relationship Diagram). \n\nI'll keep this blog post short, but essentially what I'm trying to say is, you don't have to be an artist to be a designer. Those two titles are _**not**_ mutually exclusive. They can exist harmoniously, but they don't _have_ to. In the past I've been guilty of thinking of the title \"Designer\" in this sense. I've even said that I'm not a designer. However, after giving it more thought, I am a designer. A systems designer, and I'm pretty happy with that title. \n"
        }
    ]
}